[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:74:13
             </div>
         `;
 
-        if (typeof overlay.querySelector === 'function') {
+        if (true) {
             const button = overlay.querySelector(SETUP_BUTTON_SELECTOR);
             if (button && typeof button.addEventListener === 'function') {
killedBy: kiosk device spotify auth helper safely handles document without body.appendChild
statusReason: overlay.querySelector is not a function

[Killed] OptionalChaining
kiosk-web/device-spotify-auth.js:87:13
             }
         }
 
-        if (documentScope?.body?.appendChild) {
+        if (documentScope?.body.appendChild) {
             documentScope.body.appendChild(overlay);
         }
killedBy: kiosk device spotify auth helper safely handles document without body.appendChild
statusReason: Cannot read properties of null (reading 'appendChild')

[Killed] LogicalOperator
kiosk-web/device-spotify-auth.js:140:17
         }
 
         function ensureMessageListener() {
-            if (!windowScope?.addEventListener || messageListener) {
+            if (!windowScope?.addEventListener && messageListener) {
                 return;
             }
killedBy: kiosk device spotify auth helper does not establish message listener if window does not support addEventListener
statusReason: windowScope.addEventListener is not a function

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:140:68
         }
 
         function ensureMessageListener() {
-            if (!windowScope?.addEventListener || messageListener) {
-                return;
-            }
+            if (!windowScope?.addEventListener || messageListener) {}
 
             messageListener = async (event) => {
killedBy: kiosk device spotify auth helper does not establish message listener if window does not support addEventListener
statusReason: windowScope.addEventListener is not a function

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:202:17
             const authUrl = buildSpotifyDeviceAuthStartUrl(apiBaseUrl, deviceId, devicePassword);
             const popup = windowScope?.open?.('', '_blank');
 
-            if (popup) {
+            if (true) {
                 popup.location.href = authUrl;
                 if (typeof popup.focus === 'function') {
killedBy: kiosk device spotify auth helper falls back to windowScope.location when popup open fails
statusReason: Cannot read properties of null (reading 'location')
