[Killed] OptionalChaining
kiosk-web/branding.js:48:13
         logoImage?.addEventListener?.('load', markLoaded);
         logoImage?.addEventListener?.('error', markFallback);
 
-        if (logoImage?.complete) {
+        if (logoImage.complete) {
             if (logoImage.naturalWidth > 0) {
                 markLoaded();
killedBy: kiosk branding helpers safely handles null logoImage without registering listeners
statusReason: Cannot read properties of null (reading 'complete')

[Killed] ConditionalExpression
kiosk-web/branding.js:48:13
         logoImage?.addEventListener?.('load', markLoaded);
         logoImage?.addEventListener?.('error', markFallback);
 
-        if (logoImage?.complete) {
+        if (true) {
             if (logoImage.naturalWidth > 0) {
                 markLoaded();
killedBy: kiosk branding helpers falls back to document when root is not provided
statusReason: expected 'fallback' to be 'loaded' // Object.is equality
