[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:16:55
     const SETUP_OVERLAY_ID = 'spotifyDeviceAuthSetupOverlay';
     const SETUP_BUTTON_SELECTOR = '[data-role="spotify-connect"]';
 
-    function buildSpotifyDeviceAuthEndpoints(baseUrl) {
-        return {
-            status: `${baseUrl}/api/v1/jukebox/kiosk/spotify-device-auth/status`,
-            start: `${baseUrl}/api/v1/jukebox/kiosk/spotify-device-auth/start`,
-        };
-    }
+    function buildSpotifyDeviceAuthEndpoints(baseUrl) {}
 
     function buildSpotifyDeviceAuthStartUrl(baseUrl, deviceId, devicePassword) {
killedBy: kiosk device spotify auth helper builds the device specific spotify auth endpoints
statusReason: expected undefined to deeply equal { …(2) }

[Killed] ObjectLiteral
kiosk-web/device-spotify-auth.js:17:16
     const SETUP_BUTTON_SELECTOR = '[data-role="spotify-connect"]';
 
     function buildSpotifyDeviceAuthEndpoints(baseUrl) {
-        return {
-            status: `${baseUrl}/api/v1/jukebox/kiosk/spotify-device-auth/status`,
-            start: `${baseUrl}/api/v1/jukebox/kiosk/spotify-device-auth/start`,
-        };
+        return {};
     }
 
killedBy: kiosk device spotify auth helper builds the device specific spotify auth endpoints
statusReason: expected {} to deeply equal { …(2) }

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:23:80
         };
     }
 
-    function buildSpotifyDeviceAuthStartUrl(baseUrl, deviceId, devicePassword) {
-        const url = new URL(
-            `${baseUrl}/api/v1/jukebox/kiosk/spotify-device-auth/start`,
-            typeof globalThis?.location?.href === 'string' ? globalThis.location.href : undefined
-        );
-        url.searchParams.set('device_id', deviceId);
-        if (devicePassword) {
-            url.searchParams.set('device_pwd', devicePassword);
-        }
-        return url.toString();
-    }
+    function buildSpotifyDeviceAuthStartUrl(baseUrl, deviceId, devicePassword) {}
 
     function removeSpotifyDeviceAuthSetup(documentScope) {
killedBy: kiosk device spotify auth helper builds the start url with device_id and device_pwd
statusReason: expected undefined to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Survived] ConditionalExpression
kiosk-web/device-spotify-auth.js:26:13
     function buildSpotifyDeviceAuthStartUrl(baseUrl, deviceId, devicePassword) {
         const url = new URL(
             `${baseUrl}/api/v1/jukebox/kiosk/spotify-device-auth/start`,
-            typeof globalThis?.location?.href === 'string' ? globalThis.location.href : undefined
+            true ? globalThis.location.href : undefined
         );
         url.searchParams.set('device_id', deviceId);

[Survived] OptionalChaining
kiosk-web/device-spotify-auth.js:26:20
     function buildSpotifyDeviceAuthStartUrl(baseUrl, deviceId, devicePassword) {
         const url = new URL(
             `${baseUrl}/api/v1/jukebox/kiosk/spotify-device-auth/start`,
-            typeof globalThis?.location?.href === 'string' ? globalThis.location.href : undefined
+            typeof globalThis.location?.href === 'string' ? globalThis.location.href : undefined
         );
         url.searchParams.set('device_id', deviceId);

[Killed] StringLiteral
kiosk-web/device-spotify-auth.js:28:30
             `${baseUrl}/api/v1/jukebox/kiosk/spotify-device-auth/start`,
             typeof globalThis?.location?.href === 'string' ? globalThis.location.href : undefined
         );
-        url.searchParams.set('device_id', deviceId);
+        url.searchParams.set("", deviceId);
         if (devicePassword) {
             url.searchParams.set('device_pwd', devicePassword);
killedBy: kiosk device spotify auth helper builds the start url with device_id and device_pwd
statusReason: expected 'http://127.0.0.1:3000/api/v1/jukebox/…' to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:29:29
             typeof globalThis?.location?.href === 'string' ? globalThis.location.href : undefined
         );
         url.searchParams.set('device_id', deviceId);
-        if (devicePassword) {
-            url.searchParams.set('device_pwd', devicePassword);
-        }
+        if (devicePassword) {}
         return url.toString();
     }
killedBy: kiosk device spotify auth helper builds the start url with device_id and device_pwd
statusReason: expected 'http://127.0.0.1:3000/api/v1/jukebox/…' to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:29:13
             typeof globalThis?.location?.href === 'string' ? globalThis.location.href : undefined
         );
         url.searchParams.set('device_id', deviceId);
-        if (devicePassword) {
+        if (true) {
             url.searchParams.set('device_pwd', devicePassword);
         }
killedBy: kiosk device spotify auth helper builds the start url without device_pwd when password is empty
statusReason: expected 'http://127.0.0.1:3000/api/v1/jukebox/…' not to contain 'device_pwd'

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:35:58
         return url.toString();
     }
 
-    function removeSpotifyDeviceAuthSetup(documentScope) {
-        const existing = documentScope?.getElementById?.(SETUP_OVERLAY_ID);
-        if (!existing) {
-            return;
-        }
-
-        if (typeof existing.remove === 'function') {
-            existing.remove();
-            return;
-        }
-
-        if (documentScope?.body?.removeChild) {
-            documentScope.body.removeChild(existing);
-        }
-    }
+    function removeSpotifyDeviceAuthSetup(documentScope) {}
 
     function renderSpotifyDeviceAuthSetup(documentScope, options = {}) {
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected { tagName: 'div', …(8) } to be null

[Survived] OptionalChaining
kiosk-web/device-spotify-auth.js:36:26
     }
 
     function removeSpotifyDeviceAuthSetup(documentScope) {
-        const existing = documentScope?.getElementById?.(SETUP_OVERLAY_ID);
+        const existing = documentScope?.getElementById(SETUP_OVERLAY_ID);
         if (!existing) {
             return;

[Survived] OptionalChaining
kiosk-web/device-spotify-auth.js:36:26
     }
 
     function removeSpotifyDeviceAuthSetup(documentScope) {
-        const existing = documentScope?.getElementById?.(SETUP_OVERLAY_ID);
+        const existing = documentScope.getElementById?.(SETUP_OVERLAY_ID);
         if (!existing) {
             return;

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:37:13
 
     function removeSpotifyDeviceAuthSetup(documentScope) {
         const existing = documentScope?.getElementById?.(SETUP_OVERLAY_ID);
-        if (!existing) {
+        if (true) {
             return;
         }
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected { tagName: 'div', …(8) } to be null

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:37:24
 
     function removeSpotifyDeviceAuthSetup(documentScope) {
         const existing = documentScope?.getElementById?.(SETUP_OVERLAY_ID);
-        if (!existing) {
-            return;
-        }
+        if (!existing) {}
 
         if (typeof existing.remove === 'function') {
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: Cannot read properties of null (reading 'remove')

[Killed] EqualityOperator
kiosk-web/device-spotify-auth.js:41:13
             return;
         }
 
-        if (typeof existing.remove === 'function') {
+        if (typeof existing.remove !== 'function') {
             existing.remove();
             return;
killedBy: kiosk device spotify auth helper uses body.removeChild when the overlay element has no remove method
statusReason: existing.remove is not a function

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:41:13
             return;
         }
 
-        if (typeof existing.remove === 'function') {
+        if (true) {
             existing.remove();
             return;
killedBy: kiosk device spotify auth helper uses body.removeChild when the overlay element has no remove method
statusReason: existing.remove is not a function

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:46:13
             return;
         }
 
-        if (documentScope?.body?.removeChild) {
+        if (false) {
             documentScope.body.removeChild(existing);
         }
killedBy: kiosk device spotify auth helper uses body.removeChild when the overlay element has no remove method
statusReason: expected "vi.fn()" to be called with arguments: [ { tagName: 'div', …(7) } ]

Number of calls: 0

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:46:47
             return;
         }
 
-        if (documentScope?.body?.removeChild) {
-            documentScope.body.removeChild(existing);
-        }
+        if (documentScope?.body?.removeChild) {}
     }
 
killedBy: kiosk device spotify auth helper uses body.removeChild when the overlay element has no remove method
statusReason: expected "vi.fn()" to be called with arguments: [ { tagName: 'div', …(7) } ]

Number of calls: 0

[Killed] BooleanLiteral
kiosk-web/device-spotify-auth.js:52:13
     }
 
     function renderSpotifyDeviceAuthSetup(documentScope, options = {}) {
-        if (!documentScope?.createElement) {
+        if (documentScope?.createElement) {
             return null;
         }
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: expected null not to be null

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:52:13
     }
 
     function renderSpotifyDeviceAuthSetup(documentScope, options = {}) {
-        if (!documentScope?.createElement) {
+        if (true) {
             return null;
         }
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: expected null not to be null

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:67:79
                 <div class="spotify-device-auth-setup-copy">
                     <div class="spotify-device-auth-setup-eyebrow">Spotify connect required</div>
                     <h2 class="spotify-device-auth-setup-title">Spotify bağlantısı gerekli</h2>
-                    <p class="spotify-device-auth-setup-message">${escapeHtml(options.reason || 'Bu cihazın Spotify bağlantısını tamamlayın.')}</p>
+                    <p class="spotify-device-auth-setup-message">${escapeHtml(false)}</p>
                 </div>
                 <button type="button" class="spotify-device-auth-setup-button" data-role="spotify-connect">Bağlan</button>
killedBy: kiosk device spotify auth helper escapes html special characters in the setup overlay reason
statusReason: expected '\n            <div class="spotify-dev…' to contain '&lt;script&gt;'

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:67:79
                 <div class="spotify-device-auth-setup-copy">
                     <div class="spotify-device-auth-setup-eyebrow">Spotify connect required</div>
                     <h2 class="spotify-device-auth-setup-title">Spotify bağlantısı gerekli</h2>
-                    <p class="spotify-device-auth-setup-message">${escapeHtml(options.reason || 'Bu cihazın Spotify bağlantısını tamamlayın.')}</p>
+                    <p class="spotify-device-auth-setup-message">${escapeHtml(true)}</p>
                 </div>
                 <button type="button" class="spotify-device-auth-setup-button" data-role="spotify-connect">Bağlan</button>
killedBy: kiosk device spotify auth helper escapes html special characters in the setup overlay reason
statusReason: expected '\n            <div class="spotify-dev…' to contain '&lt;script&gt;'

[Killed] EqualityOperator
kiosk-web/device-spotify-auth.js:74:13
             </div>
         `;
 
-        if (typeof overlay.querySelector === 'function') {
+        if (typeof overlay.querySelector !== 'function') {
             const button = overlay.querySelector(SETUP_BUTTON_SELECTOR);
             if (button && typeof button.addEventListener === 'function') {
killedBy: kiosk device spotify auth helper wires the connect button click handler when querySelector finds it
statusReason: expected "vi.fn()" to be called with arguments: [ 'click', Any<Function> ]

Number of calls: 0

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:74:58
             </div>
         `;
 
-        if (typeof overlay.querySelector === 'function') {
-            const button = overlay.querySelector(SETUP_BUTTON_SELECTOR);
-            if (button && typeof button.addEventListener === 'function') {
-                button.addEventListener('click', async () => {
-                    await options.onConnect?.();
-                });
-            } else if (button) {
-                button.onclick = async () => {
-                    await options.onConnect?.();
-                };
-            }
-        }
+        if (typeof overlay.querySelector === 'function') {}
 
         if (documentScope?.body?.appendChild) {
killedBy: kiosk device spotify auth helper wires the connect button click handler when querySelector finds it
statusReason: expected "vi.fn()" to be called with arguments: [ 'click', Any<Function> ]

Number of calls: 0

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:76:17
 
         if (typeof overlay.querySelector === 'function') {
             const button = overlay.querySelector(SETUP_BUTTON_SELECTOR);
-            if (button && typeof button.addEventListener === 'function') {
+            if (true) {
                 button.addEventListener('click', async () => {
                     await options.onConnect?.();
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: Cannot read properties of null (reading 'addEventListener')

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:76:17
 
         if (typeof overlay.querySelector === 'function') {
             const button = overlay.querySelector(SETUP_BUTTON_SELECTOR);
-            if (button && typeof button.addEventListener === 'function') {
+            if (false) {
                 button.addEventListener('click', async () => {
                     await options.onConnect?.();
killedBy: kiosk device spotify auth helper wires the connect button click handler when querySelector finds it
statusReason: expected "vi.fn()" to be called with arguments: [ 'click', Any<Function> ]

Number of calls: 0

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:77:62
         if (typeof overlay.querySelector === 'function') {
             const button = overlay.querySelector(SETUP_BUTTON_SELECTOR);
             if (button && typeof button.addEventListener === 'function') {
-                button.addEventListener('click', async () => {
-                    await options.onConnect?.();
-                });
+                button.addEventListener('click', async () => {});
             } else if (button) {
                 button.onclick = async () => {
killedBy: kiosk device spotify auth helper wires the connect button click handler when querySelector finds it
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
kiosk-web/device-spotify-auth.js:77:41
         if (typeof overlay.querySelector === 'function') {
             const button = overlay.querySelector(SETUP_BUTTON_SELECTOR);
             if (button && typeof button.addEventListener === 'function') {
-                button.addEventListener('click', async () => {
+                button.addEventListener("", async () => {
                     await options.onConnect?.();
                 });
killedBy: kiosk device spotify auth helper wires the connect button click handler when querySelector finds it
statusReason: expected "vi.fn()" to be called with arguments: [ 'click', Any<Function> ]

Received:

  1st vi.fn() call:

  [
-   "click",

[Survived] OptionalChaining
kiosk-web/device-spotify-auth.js:78:27
             const button = overlay.querySelector(SETUP_BUTTON_SELECTOR);
             if (button && typeof button.addEventListener === 'function') {
                 button.addEventListener('click', async () => {
-                    await options.onConnect?.();
+                    await options.onConnect();
                 });
             } else if (button) {

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:80:24
                 button.addEventListener('click', async () => {
                     await options.onConnect?.();
                 });
-            } else if (button) {
+            } else if (true) {
                 button.onclick = async () => {
                     await options.onConnect?.();
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: Cannot set properties of null (setting 'onclick')

[NoCoverage] BlockStatement
kiosk-web/device-spotify-auth.js:80:32
                 button.addEventListener('click', async () => {
                     await options.onConnect?.();
                 });
-            } else if (button) {
-                button.onclick = async () => {
-                    await options.onConnect?.();
-                };
-            }
+            } else if (button) {}
         }
 

[NoCoverage] BlockStatement
kiosk-web/device-spotify-auth.js:81:46
                     await options.onConnect?.();
                 });
             } else if (button) {
-                button.onclick = async () => {
-                    await options.onConnect?.();
-                };
+                button.onclick = async () => {};
             }
         }

[NoCoverage] OptionalChaining
kiosk-web/device-spotify-auth.js:82:27
                 });
             } else if (button) {
                 button.onclick = async () => {
-                    await options.onConnect?.();
+                    await options.onConnect();
                 };
             }

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:87:13
             }
         }
 
-        if (documentScope?.body?.appendChild) {
+        if (false) {
             documentScope.body.appendChild(overlay);
         }
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: expected null not to be null

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:87:47
             }
         }
 
-        if (documentScope?.body?.appendChild) {
-            documentScope.body.appendChild(overlay);
-        }
+        if (documentScope?.body?.appendChild) {}
 
         return overlay;
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: expected null not to be null

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:94:32
         return overlay;
     }
 
-    function escapeHtml(value) {
-        return String(value ?? '')
-            .replace(/&/g, '&amp;')
-            .replace(/</g, '&lt;')
-            .replace(/>/g, '&gt;')
-            .replace(/"/g, '&quot;')
-            .replace(/'/g, '&#39;');
-    }
+    function escapeHtml(value) {}
 
     function createSpotifyDeviceAuthController(options = {}) {
killedBy: kiosk device spotify auth helper escapes html special characters in the setup overlay reason
statusReason: expected '\n            <div class="spotify-dev…' to contain '&lt;script&gt;'

[Killed] LogicalOperator
kiosk-web/device-spotify-auth.js:95:23
     }
 
     function escapeHtml(value) {
-        return String(value ?? '')
+        return String(value && '')
             .replace(/&/g, '&amp;')
             .replace(/</g, '&lt;')
killedBy: kiosk device spotify auth helper escapes html special characters in the setup overlay reason
statusReason: expected '\n            <div class="spotify-dev…' to contain '&lt;script&gt;'

[Survived] StringLiteral
kiosk-web/device-spotify-auth.js:96:28
 
     function escapeHtml(value) {
         return String(value ?? '')
-            .replace(/&/g, '&amp;')
+            .replace(/&/g, "")
             .replace(/</g, '&lt;')
             .replace(/>/g, '&gt;')

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:105:29
 
     function createSpotifyDeviceAuthController(options = {}) {
         const documentScope = options.document;
-        const windowScope = options.window || (typeof globalThis !== 'undefined' ? globalThis : this);
+        const windowScope = true;
         const apiBaseUrl = options.apiBaseUrl || '';
         const deviceId = options.deviceId;
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected "vi.fn()" to be called with arguments: [ '', '_blank' ]

Number of calls: 0

[Killed] LogicalOperator
kiosk-web/device-spotify-auth.js:105:29
 
     function createSpotifyDeviceAuthController(options = {}) {
         const documentScope = options.document;
-        const windowScope = options.window || (typeof globalThis !== 'undefined' ? globalThis : this);
+        const windowScope = options.window && (typeof globalThis !== 'undefined' ? globalThis : this);
         const apiBaseUrl = options.apiBaseUrl || '';
         const deviceId = options.deviceId;
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected "vi.fn()" to be called with arguments: [ '', '_blank' ]

Number of calls: 0

[Killed] LogicalOperator
kiosk-web/device-spotify-auth.js:106:28
     function createSpotifyDeviceAuthController(options = {}) {
         const documentScope = options.document;
         const windowScope = options.window || (typeof globalThis !== 'undefined' ? globalThis : this);
-        const apiBaseUrl = options.apiBaseUrl || '';
+        const apiBaseUrl = options.apiBaseUrl && '';
         const deviceId = options.deviceId;
         const devicePassword = options.devicePassword || '';
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected 'http://localhost:3000/api/v1/jukebox/…' to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:106:28
     function createSpotifyDeviceAuthController(options = {}) {
         const documentScope = options.document;
         const windowScope = options.window || (typeof globalThis !== 'undefined' ? globalThis : this);
-        const apiBaseUrl = options.apiBaseUrl || '';
+        const apiBaseUrl = true;
         const deviceId = options.deviceId;
         const devicePassword = options.devicePassword || '';
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected 'http://localhost:3000/true/api/v1/juk…' to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:108:32
         const windowScope = options.window || (typeof globalThis !== 'undefined' ? globalThis : this);
         const apiBaseUrl = options.apiBaseUrl || '';
         const deviceId = options.deviceId;
-        const devicePassword = options.devicePassword || '';
+        const devicePassword = false;
         const endpoints = buildSpotifyDeviceAuthEndpoints(apiBaseUrl);
 
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected 'http://127.0.0.1:3000/api/v1/jukebox/…' to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Killed] LogicalOperator
kiosk-web/device-spotify-auth.js:108:32
         const windowScope = options.window || (typeof globalThis !== 'undefined' ? globalThis : this);
         const apiBaseUrl = options.apiBaseUrl || '';
         const deviceId = options.deviceId;
-        const devicePassword = options.devicePassword || '';
+        const devicePassword = options.devicePassword && '';
         const endpoints = buildSpotifyDeviceAuthEndpoints(apiBaseUrl);
 
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected 'http://127.0.0.1:3000/api/v1/jukebox/…' to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:114:50
         let currentStatus = null;
         let messageListener = null;
 
-        async function fetchJson(url, init = {}) {
-            const response = await options.fetch(url, {
-                ...init,
-                headers: {
-                    'Content-Type': 'application/json',
-                    ...(init.headers || {}),
-                },
-            });
-
-            if (!response.ok) {
-                let errorMessage = `Spotify device auth request failed (${response.status})`;
-                try {
-                    const errorData = await response.json();
-                    if (errorData?.error) {
-                        errorMessage = errorData.error;
-                    }
-                } catch (error) {
-                    // Ignore secondary parse errors.
-                }
-                throw new Error(errorMessage);
-            }
-
-            return response.json();
-        }
+        async function fetchJson(url, init = {}) {}
 
         function ensureMessageListener() {
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Survived] ObjectLiteral
kiosk-web/device-spotify-auth.js:117:26
         async function fetchJson(url, init = {}) {
             const response = await options.fetch(url, {
                 ...init,
-                headers: {
-                    'Content-Type': 'application/json',
-                    ...(init.headers || {}),
-                },
+                headers: {},
             });
 

[Survived] ConditionalExpression
kiosk-web/device-spotify-auth.js:119:25
                 ...init,
                 headers: {
                     'Content-Type': 'application/json',
-                    ...(init.headers || {}),
+                    ...(false),
                 },
             });

[Survived] LogicalOperator
kiosk-web/device-spotify-auth.js:119:25
                 ...init,
                 headers: {
                     'Content-Type': 'application/json',
-                    ...(init.headers || {}),
+                    ...(init.headers && {}),
                 },
             });

[NoCoverage] BlockStatement
kiosk-web/device-spotify-auth.js:125:21
 
             if (!response.ok) {
                 let errorMessage = `Spotify device auth request failed (${response.status})`;
-                try {
-                    const errorData = await response.json();
-                    if (errorData?.error) {
-                        errorMessage = errorData.error;
-                    }
-                } catch (error) {
+                try {} catch (error) {
                     // Ignore secondary parse errors.
                 }

[NoCoverage] OptionalChaining
kiosk-web/device-spotify-auth.js:127:25
                 let errorMessage = `Spotify device auth request failed (${response.status})`;
                 try {
                     const errorData = await response.json();
-                    if (errorData?.error) {
+                    if (errorData.error) {
                         errorMessage = errorData.error;
                     }

[NoCoverage] BlockStatement
kiosk-web/device-spotify-auth.js:127:43
                 let errorMessage = `Spotify device auth request failed (${response.status})`;
                 try {
                     const errorData = await response.json();
-                    if (errorData?.error) {
-                        errorMessage = errorData.error;
-                    }
+                    if (errorData?.error) {}
                 } catch (error) {
                     // Ignore secondary parse errors.

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:139:42
             return response.json();
         }
 
-        function ensureMessageListener() {
-            if (!windowScope?.addEventListener || messageListener) {
-                return;
-            }
-
-            messageListener = async (event) => {
-                if (!event?.data || event.data.type !== 'SPOTIFY_DEVICE_AUTH_SUCCESS') {
-                    return;
-                }
-
-                if (event.data.deviceId && event.data.deviceId !== deviceId) {
-                    return;
-                }
-
-                await refreshStatus();
-            };
-
-            windowScope.addEventListener('message', messageListener);
-        }
+        function ensureMessageListener() {}
 
         function destroy() {
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: messageHandler is not a function

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:140:17
         }
 
         function ensureMessageListener() {
-            if (!windowScope?.addEventListener || messageListener) {
+            if (true) {
                 return;
             }
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: messageHandler is not a function
