[Killed] OptionalChaining
kiosk-web/spotify-player.js:56:30
     }
 
     function mapSpotifyPlayerState(state, previousState = null) {
-        const currentTrack = state?.track_window?.current_track ?? null;
+        const currentTrack = state?.track_window.current_track ?? null;
         const durationMs = currentTrack?.duration_ms ?? null;
         const positionMs = typeof state?.position === 'number' ? state.position : 0;
killedBy: kiosk spotify helpers handles missing track_window in mapSpotifyPlayerState
statusReason: Cannot read properties of undefined (reading 'current_track')
