[Killed] BlockStatement
kiosk-web/branding.js:13:47
     root.KioskBranding = api;
 })(typeof globalThis !== 'undefined' ? globalThis : this, function () {
 /* Stryker restore all */
-    function setBrandLogoState(params, state) {
-        const logoContainer = params?.logoContainer ?? null;
-        const logoImage = params?.logoImage ?? null;
-        const logoText = params?.logoText ?? null;
-
-        if (logoContainer?.dataset) {
-            logoContainer.dataset.logoState = state;
-        }
-
-        logoImage?.classList?.toggle('is-hidden', state !== 'loaded');
-        logoText?.classList?.toggle('is-hidden', state === 'loaded');
-
-        return state;
-    }
+    function setBrandLogoState(params, state) {}
 
     function initializeBrandLogoFallback(options = {}) {
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected undefined to be 'loaded' // Object.is equality

[Killed] LogicalOperator
kiosk-web/branding.js:14:31
 })(typeof globalThis !== 'undefined' ? globalThis : this, function () {
 /* Stryker restore all */
     function setBrandLogoState(params, state) {
-        const logoContainer = params?.logoContainer ?? null;
+        const logoContainer = params?.logoContainer && null;
         const logoImage = params?.logoImage ?? null;
         const logoText = params?.logoText ?? null;
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected undefined to be 'loaded' // Object.is equality

[Killed] OptionalChaining
kiosk-web/branding.js:14:31
 })(typeof globalThis !== 'undefined' ? globalThis : this, function () {
 /* Stryker restore all */
     function setBrandLogoState(params, state) {
-        const logoContainer = params?.logoContainer ?? null;
+        const logoContainer = params.logoContainer ?? null;
         const logoImage = params?.logoImage ?? null;
         const logoText = params?.logoText ?? null;
killedBy: kiosk branding helpers does not throw when setBrandLogoState is called with null params
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] OptionalChaining
kiosk-web/branding.js:15:27
 /* Stryker restore all */
     function setBrandLogoState(params, state) {
         const logoContainer = params?.logoContainer ?? null;
-        const logoImage = params?.logoImage ?? null;
+        const logoImage = params.logoImage ?? null;
         const logoText = params?.logoText ?? null;
 
killedBy: kiosk branding helpers does not throw when setBrandLogoState is called with null params
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] LogicalOperator
kiosk-web/branding.js:15:27
 /* Stryker restore all */
     function setBrandLogoState(params, state) {
         const logoContainer = params?.logoContainer ?? null;
-        const logoImage = params?.logoImage ?? null;
+        const logoImage = params?.logoImage && null;
         const logoText = params?.logoText ?? null;
 
killedBy: kiosk branding helpers shows the RadioTEDU text fallback when the logo fails to load
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
kiosk-web/branding.js:16:26
     function setBrandLogoState(params, state) {
         const logoContainer = params?.logoContainer ?? null;
         const logoImage = params?.logoImage ?? null;
-        const logoText = params?.logoText ?? null;
+        const logoText = params?.logoText && null;
 
         if (logoContainer?.dataset) {
killedBy: kiosk branding helpers shows the RadioTEDU text fallback when the logo fails to load
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
kiosk-web/branding.js:16:26
     function setBrandLogoState(params, state) {
         const logoContainer = params?.logoContainer ?? null;
         const logoImage = params?.logoImage ?? null;
-        const logoText = params?.logoText ?? null;
+        const logoText = params.logoText ?? null;
 
         if (logoContainer?.dataset) {
killedBy: kiosk branding helpers does not throw when setBrandLogoState is called with null params
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
kiosk-web/branding.js:18:37
         const logoImage = params?.logoImage ?? null;
         const logoText = params?.logoText ?? null;
 
-        if (logoContainer?.dataset) {
-            logoContainer.dataset.logoState = state;
-        }
+        if (logoContainer?.dataset) {}
 
         logoImage?.classList?.toggle('is-hidden', state !== 'loaded');
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected undefined to be 'loaded' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/branding.js:18:13
         const logoImage = params?.logoImage ?? null;
         const logoText = params?.logoText ?? null;
 
-        if (logoContainer?.dataset) {
+        if (true) {
             logoContainer.dataset.logoState = state;
         }
killedBy: kiosk branding helpers does not throw when setBrandLogoState is called with null params
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
kiosk-web/branding.js:22:51
             logoContainer.dataset.logoState = state;
         }
 
-        logoImage?.classList?.toggle('is-hidden', state !== 'loaded');
+        logoImage?.classList?.toggle('is-hidden', true);
         logoText?.classList?.toggle('is-hidden', state === 'loaded');
 
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
kiosk-web/branding.js:22:51
             logoContainer.dataset.logoState = state;
         }
 
-        logoImage?.classList?.toggle('is-hidden', state !== 'loaded');
+        logoImage?.classList?.toggle('is-hidden', state === 'loaded');
         logoText?.classList?.toggle('is-hidden', state === 'loaded');
 
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
kiosk-web/branding.js:23:9
         }
 
         logoImage?.classList?.toggle('is-hidden', state !== 'loaded');
-        logoText?.classList?.toggle('is-hidden', state === 'loaded');
+        logoText.classList?.toggle('is-hidden', state === 'loaded');
 
         return state;
killedBy: kiosk branding helpers does not throw when setBrandLogoState is called with null params
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
kiosk-web/branding.js:23:50
         }
 
         logoImage?.classList?.toggle('is-hidden', state !== 'loaded');
-        logoText?.classList?.toggle('is-hidden', state === 'loaded');
+        logoText?.classList?.toggle('is-hidden', false);
 
         return state;
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
kiosk-web/branding.js:29:44
     }
 
     function initializeBrandLogoFallback(options = {}) {
-        const rootScope = options.root ?? (typeof document !== 'undefined' ? document : null);
+        const rootScope = options.root ?? (false ? document : null);
         const logoContainer = options.logoContainer ?? rootScope?.getElementById?.('brandLogo') ?? null;
         const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;

[Survived] ConditionalExpression
kiosk-web/branding.js:29:44
     }
 
     function initializeBrandLogoFallback(options = {}) {
-        const rootScope = options.root ?? (typeof document !== 'undefined' ? document : null);
+        const rootScope = options.root ?? (true ? document : null);
         const logoContainer = options.logoContainer ?? rootScope?.getElementById?.('brandLogo') ?? null;
         const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;

[Killed] LogicalOperator
kiosk-web/branding.js:30:31
 
     function initializeBrandLogoFallback(options = {}) {
         const rootScope = options.root ?? (typeof document !== 'undefined' ? document : null);
-        const logoContainer = options.logoContainer ?? rootScope?.getElementById?.('brandLogo') ?? null;
+        const logoContainer = options.logoContainer && rootScope?.getElementById?.('brandLogo') ?? null;
         const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;
         const logoText = options.logoText ?? rootScope?.getElementById?.('brandLogoText') ?? null;
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected undefined to be 'loaded' // Object.is equality

[Killed] LogicalOperator
kiosk-web/branding.js:30:31
 
     function initializeBrandLogoFallback(options = {}) {
         const rootScope = options.root ?? (typeof document !== 'undefined' ? document : null);
-        const logoContainer = options.logoContainer ?? rootScope?.getElementById?.('brandLogo') ?? null;
+        const logoContainer = (options.logoContainer ?? rootScope?.getElementById?.('brandLogo')) && null;
         const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;
         const logoText = options.logoText ?? rootScope?.getElementById?.('brandLogoText') ?? null;
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected undefined to be 'loaded' // Object.is equality

[Killed] LogicalOperator
kiosk-web/branding.js:31:27
     function initializeBrandLogoFallback(options = {}) {
         const rootScope = options.root ?? (typeof document !== 'undefined' ? document : null);
         const logoContainer = options.logoContainer ?? rootScope?.getElementById?.('brandLogo') ?? null;
-        const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;
+        const logoImage = options.logoImage && rootScope?.getElementById?.('brandLogoImage') ?? null;
         const logoText = options.logoText ?? rootScope?.getElementById?.('brandLogoText') ?? null;
 
killedBy: kiosk branding helpers shows the RadioTEDU text fallback when the logo fails to load
statusReason: expected 'loaded' to be 'fallback' // Object.is equality

[Killed] LogicalOperator
kiosk-web/branding.js:31:27
     function initializeBrandLogoFallback(options = {}) {
         const rootScope = options.root ?? (typeof document !== 'undefined' ? document : null);
         const logoContainer = options.logoContainer ?? rootScope?.getElementById?.('brandLogo') ?? null;
-        const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;
+        const logoImage = (options.logoImage ?? rootScope?.getElementById?.('brandLogoImage')) && null;
         const logoText = options.logoText ?? rootScope?.getElementById?.('brandLogoText') ?? null;
 
killedBy: kiosk branding helpers shows the RadioTEDU text fallback when the logo fails to load
statusReason: expected 'loaded' to be 'fallback' // Object.is equality

[Killed] LogicalOperator
kiosk-web/branding.js:32:26
         const rootScope = options.root ?? (typeof document !== 'undefined' ? document : null);
         const logoContainer = options.logoContainer ?? rootScope?.getElementById?.('brandLogo') ?? null;
         const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;
-        const logoText = options.logoText ?? rootScope?.getElementById?.('brandLogoText') ?? null;
+        const logoText = options.logoText && rootScope?.getElementById?.('brandLogoText') ?? null;
 
         const elements = { logoContainer, logoImage, logoText };
killedBy: kiosk branding helpers shows the RadioTEDU text fallback when the logo fails to load
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
kiosk-web/branding.js:32:26
         const rootScope = options.root ?? (typeof document !== 'undefined' ? document : null);
         const logoContainer = options.logoContainer ?? rootScope?.getElementById?.('brandLogo') ?? null;
         const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;
-        const logoText = options.logoText ?? rootScope?.getElementById?.('brandLogoText') ?? null;
+        const logoText = (options.logoText ?? rootScope?.getElementById?.('brandLogoText')) && null;
 
         const elements = { logoContainer, logoImage, logoText };
killedBy: kiosk branding helpers shows the RadioTEDU text fallback when the logo fails to load
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
kiosk-web/branding.js:34:26
         const logoImage = options.logoImage ?? rootScope?.getElementById?.('brandLogoImage') ?? null;
         const logoText = options.logoText ?? rootScope?.getElementById?.('brandLogoText') ?? null;
 
-        const elements = { logoContainer, logoImage, logoText };
+        const elements = {};
         let currentState = setBrandLogoState(elements, 'loaded');
 
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected undefined to be 'loaded' // Object.is equality

[Survived] BlockStatement
kiosk-web/branding.js:37:34
         const elements = { logoContainer, logoImage, logoText };
         let currentState = setBrandLogoState(elements, 'loaded');
 
-        const markLoaded = () => {
-            currentState = setBrandLogoState(elements, 'loaded');
-        };
+        const markLoaded = () => {};
 
         const markFallback = () => {

[Killed] StringLiteral
kiosk-web/branding.js:38:56
         let currentState = setBrandLogoState(elements, 'loaded');
 
         const markLoaded = () => {
-            currentState = setBrandLogoState(elements, 'loaded');
+            currentState = setBrandLogoState(elements, "");
         };
 
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected '' to be 'loaded' // Object.is equality

[Killed] BlockStatement
kiosk-web/branding.js:41:36
             currentState = setBrandLogoState(elements, 'loaded');
         };
 
-        const markFallback = () => {
-            currentState = setBrandLogoState(elements, 'fallback');
-        };
+        const markFallback = () => {};
 
         logoImage?.addEventListener?.('load', markLoaded);
killedBy: kiosk branding helpers shows the RadioTEDU text fallback when the logo fails to load
statusReason: expected 'loaded' to be 'fallback' // Object.is equality

[Survived] OptionalChaining
kiosk-web/branding.js:45:9
             currentState = setBrandLogoState(elements, 'fallback');
         };
 
-        logoImage?.addEventListener?.('load', markLoaded);
+        logoImage?.addEventListener('load', markLoaded);
         logoImage?.addEventListener?.('error', markFallback);
 

[Survived] OptionalChaining
kiosk-web/branding.js:45:9
             currentState = setBrandLogoState(elements, 'fallback');
         };
 
-        logoImage?.addEventListener?.('load', markLoaded);
+        logoImage.addEventListener?.('load', markLoaded);
         logoImage?.addEventListener?.('error', markFallback);
 

[Survived] OptionalChaining
kiosk-web/branding.js:46:9
         };
 
         logoImage?.addEventListener?.('load', markLoaded);
-        logoImage?.addEventListener?.('error', markFallback);
+        logoImage?.addEventListener('error', markFallback);
 
         if (logoImage?.complete) {

[Survived] OptionalChaining
kiosk-web/branding.js:46:9
         };
 
         logoImage?.addEventListener?.('load', markLoaded);
-        logoImage?.addEventListener?.('error', markFallback);
+        logoImage.addEventListener?.('error', markFallback);
 
         if (logoImage?.complete) {

[Killed] ConditionalExpression
kiosk-web/branding.js:48:13
         logoImage?.addEventListener?.('load', markLoaded);
         logoImage?.addEventListener?.('error', markFallback);
 
-        if (logoImage?.complete) {
+        if (false) {
             if (logoImage.naturalWidth > 0) {
                 markLoaded();
killedBy: kiosk branding helpers shows fallback when image is already complete but has zero natural width
statusReason: expected 'loaded' to be 'fallback' // Object.is equality

[Killed] BlockStatement
kiosk-web/branding.js:48:34
         logoImage?.addEventListener?.('load', markLoaded);
         logoImage?.addEventListener?.('error', markFallback);
 
-        if (logoImage?.complete) {
-            if (logoImage.naturalWidth > 0) {
-                markLoaded();
-            } else {
-                markFallback();
-            }
-        }
+        if (logoImage?.complete) {}
 
         return {
killedBy: kiosk branding helpers shows fallback when image is already complete but has zero natural width
statusReason: expected 'loaded' to be 'fallback' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/branding.js:49:17
         logoImage?.addEventListener?.('error', markFallback);
 
         if (logoImage?.complete) {
-            if (logoImage.naturalWidth > 0) {
+            if (false) {
                 markLoaded();
             } else {
killedBy: kiosk branding helpers treats already loaded images as loaded during initialization
statusReason: expected 'fallback' to be 'loaded' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/branding.js:49:17
         logoImage?.addEventListener?.('error', markFallback);
 
         if (logoImage?.complete) {
-            if (logoImage.naturalWidth > 0) {
+            if (true) {
                 markLoaded();
             } else {
killedBy: kiosk branding helpers shows fallback when image is already complete but has zero natural width
statusReason: expected 'loaded' to be 'fallback' // Object.is equality

[Killed] BlockStatement
kiosk-web/branding.js:51:20
         if (logoImage?.complete) {
             if (logoImage.naturalWidth > 0) {
                 markLoaded();
-            } else {
-                markFallback();
-            }
+            } else {}
         }
 
killedBy: kiosk branding helpers shows fallback when image is already complete but has zero natural width
statusReason: expected 'loaded' to be 'fallback' // Object.is equality

[Killed] ArrowFunction
kiosk-web/branding.js:57:23
         }
 
         return {
-            getState: () => currentState,
+            getState: () => undefined,
             markLoaded,
             markFallback,
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: expected undefined to be 'loaded' // Object.is equality

[Killed] ObjectLiteral
kiosk-web/branding.js:63:12
         };
     }
 
-    return {
-        initializeBrandLogoFallback,
-        setBrandLogoState,
-    };
+    return {};
 });
 
killedBy: kiosk branding helpers keeps the fallback text hidden when the logo loads successfully
statusReason: initializeBrandLogoFallback is not a function
