[Killed] BooleanLiteral
kiosk-web/device-spotify-auth.js:140:17
         }
 
         function ensureMessageListener() {
-            if (!windowScope?.addEventListener || messageListener) {
+            if (windowScope?.addEventListener || messageListener) {
                 return;
             }
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: messageHandler is not a function

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:144:48
                 return;
             }
 
-            messageListener = async (event) => {
-                if (!event?.data || event.data.type !== 'SPOTIFY_DEVICE_AUTH_SUCCESS') {
-                    return;
-                }
-
-                if (event.data.deviceId && event.data.deviceId !== deviceId) {
-                    return;
-                }
-
-                await refreshStatus();
-            };
+            messageListener = async (event) => {};
 
             windowScope.addEventListener('message', messageListener);
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] EqualityOperator
kiosk-web/device-spotify-auth.js:145:37
             }
 
             messageListener = async (event) => {
-                if (!event?.data || event.data.type !== 'SPOTIFY_DEVICE_AUTH_SUCCESS') {
+                if (!event?.data || event.data.type === 'SPOTIFY_DEVICE_AUTH_SUCCESS') {
                     return;
                 }
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BooleanLiteral
kiosk-web/device-spotify-auth.js:145:21
             }
 
             messageListener = async (event) => {
-                if (!event?.data || event.data.type !== 'SPOTIFY_DEVICE_AUTH_SUCCESS') {
+                if (event?.data || event.data.type !== 'SPOTIFY_DEVICE_AUTH_SUCCESS') {
                     return;
                 }
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] LogicalOperator
kiosk-web/device-spotify-auth.js:149:21
                     return;
                 }
 
-                if (event.data.deviceId && event.data.deviceId !== deviceId) {
+                if (event.data.deviceId || event.data.deviceId !== deviceId) {
                     return;
                 }
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:149:44
                     return;
                 }
 
-                if (event.data.deviceId && event.data.deviceId !== deviceId) {
+                if (event.data.deviceId && true) {
                     return;
                 }
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:159:28
             windowScope.addEventListener('message', messageListener);
         }
 
-        function destroy() {
-            if (messageListener && windowScope?.removeEventListener) {
-                windowScope.removeEventListener('message', messageListener);
-            }
-            messageListener = null;
-        }
+        function destroy() {}
 
         function hideSetup() {
killedBy: kiosk device spotify auth helper removes the message listener when destroy is called
statusReason: expected "vi.fn()" to be called with arguments: [ 'message', …(1) ]

Number of calls: 0

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:160:70
         }
 
         function destroy() {
-            if (messageListener && windowScope?.removeEventListener) {
-                windowScope.removeEventListener('message', messageListener);
-            }
+            if (messageListener && windowScope?.removeEventListener) {}
             messageListener = null;
         }
killedBy: kiosk device spotify auth helper removes the message listener when destroy is called
statusReason: expected "vi.fn()" to be called with arguments: [ 'message', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:160:17
         }
 
         function destroy() {
-            if (messageListener && windowScope?.removeEventListener) {
+            if (false) {
                 windowScope.removeEventListener('message', messageListener);
             }
killedBy: kiosk device spotify auth helper removes the message listener when destroy is called
statusReason: expected "vi.fn()" to be called with arguments: [ 'message', …(1) ]

Number of calls: 0

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:166:30
             messageListener = null;
         }
 
-        function hideSetup() {
-            removeSpotifyDeviceAuthSetup(documentScope);
-        }
+        function hideSetup() {}
 
         function showSetup(reason) {
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected { tagName: 'div', …(8) } to be null

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:170:36
             removeSpotifyDeviceAuthSetup(documentScope);
         }
 
-        function showSetup(reason) {
-            return renderSpotifyDeviceAuthSetup(documentScope, {
-                reason,
-                onConnect: openConnectFlow,
-            });
-        }
+        function showSetup(reason) {}
 
         async function refreshStatus() {
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: expected null not to be null

[Survived] ObjectLiteral
kiosk-web/device-spotify-auth.js:171:64
         }
 
         function showSetup(reason) {
-            return renderSpotifyDeviceAuthSetup(documentScope, {
-                reason,
-                onConnect: openConnectFlow,
-            });
+            return renderSpotifyDeviceAuthSetup(documentScope, {});
         }
 

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:177:40
             });
         }
 
-        async function refreshStatus() {
-            const payload = await fetchJson(endpoints.status, {
-                method: 'POST',
-                body: JSON.stringify({
-                    device_id: deviceId,
-                    device_pwd: devicePassword,
-                }),
-            });
-            currentStatus = payload?.data || payload || null;
-
-            if (currentStatus?.connected) {
-                hideSetup();
-                options.onConnected?.(currentStatus);
-            } else {
-                showSetup(currentStatus?.reason || 'Spotify bağlantısı gerekli');
-                options.onMissing?.(currentStatus);
-            }
-
-            return currentStatus;
-        }
+        async function refreshStatus() {}
 
         async function openConnectFlow() {
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: expected null not to be null

[Survived] ObjectLiteral
kiosk-web/device-spotify-auth.js:180:38
         async function refreshStatus() {
             const payload = await fetchJson(endpoints.status, {
                 method: 'POST',
-                body: JSON.stringify({
-                    device_id: deviceId,
-                    device_pwd: devicePassword,
-                }),
+                body: JSON.stringify({}),
             });
             currentStatus = payload?.data || payload || null;

[Killed] LogicalOperator
kiosk-web/device-spotify-auth.js:185:29
                     device_pwd: devicePassword,
                 }),
             });
-            currentStatus = payload?.data || payload || null;
+            currentStatus = payload?.data && payload || null;
 
             if (currentStatus?.connected) {
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] LogicalOperator
kiosk-web/device-spotify-auth.js:185:29
                     device_pwd: devicePassword,
                 }),
             });
-            currentStatus = payload?.data || payload || null;
+            currentStatus = (payload?.data || payload) && null;
 
             if (currentStatus?.connected) {
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:187:17
             });
             currentStatus = payload?.data || payload || null;
 
-            if (currentStatus?.connected) {
+            if (true) {
                 hideSetup();
                 options.onConnected?.(currentStatus);
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: expected null not to be null

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:187:43
             });
             currentStatus = payload?.data || payload || null;
 
-            if (currentStatus?.connected) {
-                hideSetup();
-                options.onConnected?.(currentStatus);
-            } else {
+            if (currentStatus?.connected) {} else {
                 showSetup(currentStatus?.reason || 'Spotify bağlantısı gerekli');
                 options.onMissing?.(currentStatus);
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] OptionalChaining
kiosk-web/device-spotify-auth.js:189:17
 
             if (currentStatus?.connected) {
                 hideSetup();
-                options.onConnected?.(currentStatus);
+                options.onConnected(currentStatus);
             } else {
                 showSetup(currentStatus?.reason || 'Spotify bağlantısı gerekli');
killedBy: kiosk device spotify auth helper hides the setup state after a reconnect status refresh succeeds
statusReason: options.onConnected is not a function

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:190:20
             if (currentStatus?.connected) {
                 hideSetup();
                 options.onConnected?.(currentStatus);
-            } else {
-                showSetup(currentStatus?.reason || 'Spotify bağlantısı gerekli');
-                options.onMissing?.(currentStatus);
-            }
+            } else {}
 
             return currentStatus;
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: expected null not to be null

[Survived] ConditionalExpression
kiosk-web/device-spotify-auth.js:191:27
                 hideSetup();
                 options.onConnected?.(currentStatus);
             } else {
-                showSetup(currentStatus?.reason || 'Spotify bağlantısı gerekli');
+                showSetup(true);
                 options.onMissing?.(currentStatus);
             }

[Survived] LogicalOperator
kiosk-web/device-spotify-auth.js:191:27
                 hideSetup();
                 options.onConnected?.(currentStatus);
             } else {
-                showSetup(currentStatus?.reason || 'Spotify bağlantısı gerekli');
+                showSetup(currentStatus?.reason && 'Spotify bağlantısı gerekli');
                 options.onMissing?.(currentStatus);
             }

[Killed] OptionalChaining
kiosk-web/device-spotify-auth.js:192:17
                 options.onConnected?.(currentStatus);
             } else {
                 showSetup(currentStatus?.reason || 'Spotify bağlantısı gerekli');
-                options.onMissing?.(currentStatus);
+                options.onMissing(currentStatus);
             }
 
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: options.onMissing is not a function

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:198:42
             return currentStatus;
         }
 
-        async function openConnectFlow() {
-            const authUrl = buildSpotifyDeviceAuthStartUrl(apiBaseUrl, deviceId, devicePassword);
-            const popup = windowScope?.open?.('', '_blank');
-
-            if (popup) {
-                popup.location.href = authUrl;
-                if (typeof popup.focus === 'function') {
-                    popup.focus();
-                }
-            } else if (windowScope?.location) {
-                windowScope.location.href = authUrl;
-            }
-
-            return authUrl;
-        }
+        async function openConnectFlow() {}
 
         ensureMessageListener();
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected "vi.fn()" to be called with arguments: [ '', '_blank' ]

Number of calls: 0

[Survived] OptionalChaining
kiosk-web/device-spotify-auth.js:200:27
 
         async function openConnectFlow() {
             const authUrl = buildSpotifyDeviceAuthStartUrl(apiBaseUrl, deviceId, devicePassword);
-            const popup = windowScope?.open?.('', '_blank');
+            const popup = windowScope.open?.('', '_blank');
 
             if (popup) {

[Survived] OptionalChaining
kiosk-web/device-spotify-auth.js:200:27
 
         async function openConnectFlow() {
             const authUrl = buildSpotifyDeviceAuthStartUrl(apiBaseUrl, deviceId, devicePassword);
-            const popup = windowScope?.open?.('', '_blank');
+            const popup = windowScope?.open('', '_blank');
 
             if (popup) {

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:202:17
             const authUrl = buildSpotifyDeviceAuthStartUrl(apiBaseUrl, deviceId, devicePassword);
             const popup = windowScope?.open?.('', '_blank');
 
-            if (popup) {
+            if (false) {
                 popup.location.href = authUrl;
                 if (typeof popup.focus === 'function') {
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected '' to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Killed] BlockStatement
kiosk-web/device-spotify-auth.js:202:24
             const authUrl = buildSpotifyDeviceAuthStartUrl(apiBaseUrl, deviceId, devicePassword);
             const popup = windowScope?.open?.('', '_blank');
 
-            if (popup) {
-                popup.location.href = authUrl;
-                if (typeof popup.focus === 'function') {
-                    popup.focus();
-                }
-            } else if (windowScope?.location) {
+            if (popup) {} else if (windowScope?.location) {
                 windowScope.location.href = authUrl;
             }
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected '' to be 'http://127.0.0.1:3000/api/v1/jukebox/…' // Object.is equality

[Killed] EqualityOperator
kiosk-web/device-spotify-auth.js:204:21
 
             if (popup) {
                 popup.location.href = authUrl;
-                if (typeof popup.focus === 'function') {
+                if (typeof popup.focus !== 'function') {
                     popup.focus();
                 }
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
kiosk-web/device-spotify-auth.js:204:21
 
             if (popup) {
                 popup.location.href = authUrl;
-                if (typeof popup.focus === 'function') {
+                if (false) {
                     popup.focus();
                 }
killedBy: kiosk device spotify auth helper opens the device-specific spotify authorize url
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[NoCoverage] ConditionalExpression
kiosk-web/device-spotify-auth.js:207:24
                 if (typeof popup.focus === 'function') {
                     popup.focus();
                 }
-            } else if (windowScope?.location) {
+            } else if (false) {
                 windowScope.location.href = authUrl;
             }

[NoCoverage] BlockStatement
kiosk-web/device-spotify-auth.js:207:47
                 if (typeof popup.focus === 'function') {
                     popup.focus();
                 }
-            } else if (windowScope?.location) {
-                windowScope.location.href = authUrl;
-            }
+            } else if (windowScope?.location) {}
 
             return authUrl;

[Killed] ObjectLiteral
kiosk-web/device-spotify-auth.js:216:16
 
         ensureMessageListener();
 
-        return {
-            refreshStatus,
-            openConnectFlow,
-            showSetup,
-            hideSetup,
-            destroy,
-            getStatus: () => currentStatus,
-            isSetupVisible: () => Boolean(documentScope?.getElementById?.(SETUP_OVERLAY_ID)),
-            endpoints,
-        };
+        return {};
     }
 
killedBy: kiosk device spotify auth helper shows a blocking setup state when device spotify auth is missing
statusReason: controller.refreshStatus is not a function

[Killed] ArrowFunction
kiosk-web/device-spotify-auth.js:222:24
             showSetup,
             hideSetup,
             destroy,
-            getStatus: () => currentStatus,
+            getStatus: () => undefined,
             isSetupVisible: () => Boolean(documentScope?.getElementById?.(SETUP_OVERLAY_ID)),
             endpoints,
killedBy: kiosk device spotify auth helper refreshes and exits setup after a successful auth success message
statusReason: expected undefined to deeply equal ObjectContaining{…}

[NoCoverage] OptionalChaining
kiosk-web/device-spotify-auth.js:223:43
             hideSetup,
             destroy,
             getStatus: () => currentStatus,
-            isSetupVisible: () => Boolean(documentScope?.getElementById?.(SETUP_OVERLAY_ID)),
+            isSetupVisible: () => Boolean(documentScope?.getElementById(SETUP_OVERLAY_ID)),
             endpoints,
         };

[NoCoverage] OptionalChaining
kiosk-web/device-spotify-auth.js:223:43
             hideSetup,
             destroy,
             getStatus: () => currentStatus,
-            isSetupVisible: () => Boolean(documentScope?.getElementById?.(SETUP_OVERLAY_ID)),
+            isSetupVisible: () => Boolean(documentScope.getElementById?.(SETUP_OVERLAY_ID)),
             endpoints,
         };

[Killed] ObjectLiteral
kiosk-web/device-spotify-auth.js:228:12
         };
     }
 
-    return {
-        SETUP_OVERLAY_ID,
-        buildSpotifyDeviceAuthEndpoints,
-        buildSpotifyDeviceAuthStartUrl,
-        createSpotifyDeviceAuthController,
-        renderSpotifyDeviceAuthSetup,
-        removeSpotifyDeviceAuthSetup,
-    };
+    return {};
 });
 
killedBy: kiosk device spotify auth helper builds the device specific spotify auth endpoints
statusReason: buildSpotifyDeviceAuthEndpoints is not a function
