[Killed] BlockStatement
kiosk-web/playback.js:13:34
     root.KioskPlayback = api;
 })(typeof globalThis !== 'undefined' ? globalThis : this, function () {
 /* Stryker restore all */
-    function extractSongId(song) {
-        if (song?.song_id) {
-            return song.song_id;
-        }
-
-        if (typeof song?.id === 'string' && song.id.startsWith('current-')) {
-            return song.id.slice('current-'.length);
-        }
-
-        return song?.id ?? null;
-    }
+    function extractSongId(song) {}
 
     function getSongPlaybackPlan(song, apiBaseUrl) {
killedBy: kiosk playback helpers builds an absolute local audio url for local queue items
statusReason: expected { kind: 'local', …(3) } to deeply equal { kind: 'local', …(3) }

[Killed] ConditionalExpression
kiosk-web/playback.js:14:13
 })(typeof globalThis !== 'undefined' ? globalThis : this, function () {
 /* Stryker restore all */
     function extractSongId(song) {
-        if (song?.song_id) {
+        if (false) {
             return song.song_id;
         }
killedBy: kiosk playback helpers builds an absolute local audio url for local queue items
statusReason: expected { kind: 'local', …(3) } to deeply equal { kind: 'local', …(3) }

[Killed] BlockStatement
kiosk-web/playback.js:14:28
 })(typeof globalThis !== 'undefined' ? globalThis : this, function () {
 /* Stryker restore all */
     function extractSongId(song) {
-        if (song?.song_id) {
-            return song.song_id;
-        }
+        if (song?.song_id) {}
 
         if (typeof song?.id === 'string' && song.id.startsWith('current-')) {
killedBy: kiosk playback helpers builds an absolute local audio url for local queue items
statusReason: expected { kind: 'local', …(3) } to deeply equal { kind: 'local', …(3) }

[Killed] EqualityOperator
kiosk-web/playback.js:18:13
             return song.song_id;
         }
 
-        if (typeof song?.id === 'string' && song.id.startsWith('current-')) {
+        if (typeof song?.id !== 'string' && song.id.startsWith('current-')) {
             return song.id.slice('current-'.length);
         }
killedBy: kiosk playback helpers does not apply the current- prefix extraction when id is not a string
statusReason: song.id.startsWith is not a function

[Killed] ConditionalExpression
kiosk-web/playback.js:18:13
             return song.song_id;
         }
 
-        if (typeof song?.id === 'string' && song.id.startsWith('current-')) {
+        if (false) {
             return song.id.slice('current-'.length);
         }
killedBy: kiosk playback helpers extracts song id from current- prefixed id when song_id is absent
statusReason: expected 'current-song-42' to be 'song-42' // Object.is equality

[Killed] MethodExpression
kiosk-web/playback.js:19:20
         }
 
         if (typeof song?.id === 'string' && song.id.startsWith('current-')) {
-            return song.id.slice('current-'.length);
+            return song.id;
         }
 
killedBy: kiosk playback helpers extracts song id from current- prefixed id when song_id is absent
statusReason: expected 'current-song-42' to be 'song-42' // Object.is equality

[Killed] StringLiteral
kiosk-web/playback.js:19:34
         }
 
         if (typeof song?.id === 'string' && song.id.startsWith('current-')) {
-            return song.id.slice('current-'.length);
+            return song.id.slice("".length);
         }
 
killedBy: kiosk playback helpers extracts song id from current- prefixed id when song_id is absent
statusReason: expected 'current-song-42' to be 'song-42' // Object.is equality

[Killed] LogicalOperator
kiosk-web/playback.js:22:16
             return song.id.slice('current-'.length);
         }
 
-        return song?.id ?? null;
+        return song?.id && null;
     }
 
killedBy: kiosk playback helpers does not apply the current- prefix extraction when id is not a string
statusReason: expected null to be 42 // Object.is equality

[Survived] OptionalChaining
kiosk-web/playback.js:22:16
             return song.id.slice('current-'.length);
         }
 
-        return song?.id ?? null;
+        return song.id ?? null;
     }
 

[Killed] ConditionalExpression
kiosk-web/playback.js:26:28
     }
 
     function getSongPlaybackPlan(song, apiBaseUrl) {
-        const sourceType = song?.playback_type || song?.source_type || 'local';
+        const sourceType = false;
         const songId = extractSongId(song);
 
killedBy: kiosk playback helpers classifies spotify queue items without touching file_url
statusReason: expected { kind: 'unsupported', …(3) } to deeply equal { kind: 'spotify', …(3) }

[Killed] ConditionalExpression
kiosk-web/playback.js:26:28
     }
 
     function getSongPlaybackPlan(song, apiBaseUrl) {
-        const sourceType = song?.playback_type || song?.source_type || 'local';
+        const sourceType = false || 'local';
         const songId = extractSongId(song);
 
killedBy: kiosk playback helpers classifies spotify queue items without touching file_url
statusReason: expected { kind: 'unsupported', …(3) } to deeply equal { kind: 'spotify', …(3) }

[Killed] EqualityOperator
kiosk-web/playback.js:29:13
         const sourceType = song?.playback_type || song?.source_type || 'local';
         const songId = extractSongId(song);
 
-        if (sourceType === 'spotify' && song?.spotify_uri) {
+        if (sourceType !== 'spotify' && song?.spotify_uri) {
             return {
                 kind: 'spotify',
killedBy: kiosk playback helpers classifies spotify queue items without touching file_url
statusReason: expected { kind: 'unsupported', …(3) } to deeply equal { kind: 'spotify', …(3) }

[Killed] ConditionalExpression
kiosk-web/playback.js:29:13
         const sourceType = song?.playback_type || song?.source_type || 'local';
         const songId = extractSongId(song);
 
-        if (sourceType === 'spotify' && song?.spotify_uri) {
+        if (true) {
             return {
                 kind: 'spotify',
killedBy: kiosk playback helpers builds an absolute local audio url for local queue items
statusReason: expected { kind: 'spotify', …(3) } to deeply equal { kind: 'local', …(3) }

[Killed] EqualityOperator
kiosk-web/playback.js:38:51
             };
         }
 
-        if (typeof song?.file_url === 'string' && song.file_url.length > 0) {
+        if (typeof song?.file_url === 'string' && song.file_url.length >= 0) {
             return {
                 kind: 'local',
killedBy: kiosk playback helpers returns unsupported plan when file_url is an empty string
statusReason: expected 'local' to be 'unsupported' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/playback.js:38:51
             };
         }
 
-        if (typeof song?.file_url === 'string' && song.file_url.length > 0) {
+        if (typeof song?.file_url === 'string' && true) {
             return {
                 kind: 'local',
killedBy: kiosk playback helpers returns unsupported plan when file_url is an empty string
statusReason: expected 'local' to be 'unsupported' // Object.is equality

[Killed] ArithmeticOperator
kiosk-web/playback.js:41:59
         if (typeof song?.file_url === 'string' && song.file_url.length > 0) {
             return {
                 kind: 'local',
-                audioUrl: song.file_url.startsWith('/') ? apiBaseUrl + song.file_url : song.file_url,
+                audioUrl: song.file_url.startsWith('/') ? apiBaseUrl - song.file_url : song.file_url,
                 spotifyUri: null,
                 songId,
killedBy: kiosk playback helpers builds an absolute local audio url for local queue items
statusReason: expected { kind: 'local', audioUrl: NaN, …(2) } to deeply equal { kind: 'local', …(3) }

[Killed] MethodExpression
kiosk-web/playback.js:41:27
         if (typeof song?.file_url === 'string' && song.file_url.length > 0) {
             return {
                 kind: 'local',
-                audioUrl: song.file_url.startsWith('/') ? apiBaseUrl + song.file_url : song.file_url,
+                audioUrl: song.file_url.endsWith('/') ? apiBaseUrl + song.file_url : song.file_url,
                 spotifyUri: null,
                 songId,
killedBy: kiosk playback helpers builds an absolute local audio url for local queue items
statusReason: expected { kind: 'local', …(3) } to deeply equal { kind: 'local', …(3) }

[Killed] StringLiteral
kiosk-web/playback.js:48:19
         }
 
         return {
-            kind: 'unsupported',
+            kind: "",
             audioUrl: null,
             spotifyUri: song?.spotify_uri ?? null,
killedBy: kiosk playback helpers returns unsupported plan when spotify source type has no uri
statusReason: expected { kind: '', audioUrl: null, …(2) } to deeply equal { kind: 'unsupported', …(3) }

[Survived] OptionalChaining
kiosk-web/playback.js:50:25
         return {
             kind: 'unsupported',
             audioUrl: null,
-            spotifyUri: song?.spotify_uri ?? null,
+            spotifyUri: song.spotify_uri ?? null,
             songId,
         };

[Survived] LogicalOperator
kiosk-web/playback.js:50:25
         return {
             kind: 'unsupported',
             audioUrl: null,
-            spotifyUri: song?.spotify_uri ?? null,
+            spotifyUri: song?.spotify_uri && null,
             songId,
         };

[Killed] BlockStatement
kiosk-web/playback.js:55:47
         };
     }
 
-    function shouldSyncNowPlayingView(params) {
-        if (params?.startupBlocked) {
-            return false;
-        }
-
-        if (!params?.nowPlaying) {
-            return false;
-        }
-
-        return Boolean(params.isPlaying || params.spotifyTrackUri);
-    }
+    function shouldSyncNowPlayingView(params) {}
 
     return {
killedBy: kiosk playback helpers syncs the playing view when remote playback is already active for the current now-playing item
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
kiosk-web/playback.js:56:13
     }
 
     function shouldSyncNowPlayingView(params) {
-        if (params?.startupBlocked) {
+        if (true) {
             return false;
         }
killedBy: kiosk playback helpers syncs the playing view when remote playback is already active for the current now-playing item
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
kiosk-web/playback.js:56:13
     }
 
     function shouldSyncNowPlayingView(params) {
-        if (params?.startupBlocked) {
+        if (false) {
             return false;
         }
killedBy: kiosk playback helpers syncs the playing view when remote playback is already active for the current now-playing item
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
kiosk-web/playback.js:57:20
 
     function shouldSyncNowPlayingView(params) {
         if (params?.startupBlocked) {
-            return false;
+            return true;
         }
 
killedBy: kiosk playback helpers syncs the playing view when remote playback is already active for the current now-playing item
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
kiosk-web/playback.js:60:13
             return false;
         }
 
-        if (!params?.nowPlaying) {
+        if (params?.nowPlaying) {
             return false;
         }
killedBy: kiosk playback helpers syncs the playing view when remote playback is already active for the current now-playing item
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
kiosk-web/playback.js:60:14
             return false;
         }
 
-        if (!params?.nowPlaying) {
+        if (!params.nowPlaying) {
             return false;
         }
killedBy: kiosk playback helpers returns false from shouldSyncNowPlayingView when params is null
statusReason: Cannot read properties of null (reading 'nowPlaying')

[Killed] BooleanLiteral
kiosk-web/playback.js:61:20
         }
 
         if (!params?.nowPlaying) {
-            return false;
+            return true;
         }
 
killedBy: kiosk playback helpers syncs the playing view when remote playback is already active for the current now-playing item
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
kiosk-web/playback.js:64:24
             return false;
         }
 
-        return Boolean(params.isPlaying || params.spotifyTrackUri);
+        return Boolean(params.isPlaying && params.spotifyTrackUri);
     }
 
killedBy: kiosk playback helpers syncs the now playing view when only spotifyTrackUri is set even if isPlaying is false
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
kiosk-web/playback.js:64:24
             return false;
         }
 
-        return Boolean(params.isPlaying || params.spotifyTrackUri);
+        return Boolean(false);
     }
 
killedBy: kiosk playback helpers syncs the playing view when remote playback is already active for the current now-playing item
statusReason: expected false to be true // Object.is equality
