[Killed] BlockStatement
kiosk-web/spotify-player.js:16:36
     const SDK_URL = 'https://sdk.scdn.co/spotify-player.js';
     let sdkLoadPromise = null;
 
-    function normalizeTrack(track) {
-        if (!track) {
-            return {
-                track_uri: null,
-                track_id: null,
-                track_name: null,
-                track_artists: [],
-                duration_ms: null,
-            };
-        }
-
-        return {
-            track_uri: track.uri ?? null,
-            track_id: track.id ?? null,
-            track_name: track.name ?? null,
-            track_artists: Array.isArray(track.artists) ? track.artists.map((artist) => artist?.name).filter(Boolean) : [],
-            duration_ms: track.duration_ms ?? null,
-        };
-    }
+    function normalizeTrack(track) {}
 
     function didTrackEnd(previousState, currentState) {
killedBy: kiosk playback helpers polls spotify state so the 80 percent autoplay rule uses fresh playback progress
statusReason: expected [ Array(1) ] to include 'http://127.0.0.1:3000/api/v1/jukebox/…'

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:17:13
     let sdkLoadPromise = null;
 
     function normalizeTrack(track) {
-        if (!track) {
+        if (false) {
             return {
                 track_uri: null,
killedBy: kiosk playback helpers detects spotify track end from polled player state when the sdk does not push a final event
statusReason: expected "handleSpotifyTrackEnded" to be called 1 times, but got 0 times

[Killed] BlockStatement
kiosk-web/spotify-player.js:17:21
     let sdkLoadPromise = null;
 
     function normalizeTrack(track) {
-        if (!track) {
-            return {
-                track_uri: null,
-                track_id: null,
-                track_name: null,
-                track_artists: [],
-                duration_ms: null,
-            };
-        }
+        if (!track) {}
 
         return {
killedBy: kiosk playback helpers detects spotify track end from polled player state when the sdk does not push a final event
statusReason: expected "handleSpotifyTrackEnded" to be called 1 times, but got 0 times

[Killed] ArrayDeclaration
kiosk-web/spotify-player.js:22:32
                 track_uri: null,
                 track_id: null,
                 track_name: null,
-                track_artists: [],
+                track_artists: ["Stryker was here"],
                 duration_ms: null,
             };
killedBy: kiosk spotify helpers maps a null state to a fully null track payload
statusReason: expected { Object (paused, position_ms, ...) } to deeply equal { Object (paused, position_ms, ...) }

[Killed] LogicalOperator
kiosk-web/spotify-player.js:28:24
         }
 
         return {
-            track_uri: track.uri ?? null,
+            track_uri: track.uri && null,
             track_id: track.id ?? null,
             track_name: track.name ?? null,
killedBy: kiosk playback helpers polls spotify state so the 80 percent autoplay rule uses fresh playback progress
statusReason: expected [ Array(1) ] to include 'http://127.0.0.1:3000/api/v1/jukebox/…'

[Killed] LogicalOperator
kiosk-web/spotify-player.js:29:23
 
         return {
             track_uri: track.uri ?? null,
-            track_id: track.id ?? null,
+            track_id: track.id && null,
             track_name: track.name ?? null,
             track_artists: Array.isArray(track.artists) ? track.artists.map((artist) => artist?.name).filter(Boolean) : [],
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected { device_id: 'device-1', …(3) } to deeply equal { device_id: 'device-1', …(3) }

[Killed] LogicalOperator
kiosk-web/spotify-player.js:30:25
         return {
             track_uri: track.uri ?? null,
             track_id: track.id ?? null,
-            track_name: track.name ?? null,
+            track_name: track.name && null,
             track_artists: Array.isArray(track.artists) ? track.artists.map((artist) => artist?.name).filter(Boolean) : [],
             duration_ms: track.duration_ms ?? null,
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected { device_id: 'device-1', …(3) } to deeply equal { device_id: 'device-1', …(3) }

[Killed] ArrowFunction
kiosk-web/spotify-player.js:31:77
             track_uri: track.uri ?? null,
             track_id: track.id ?? null,
             track_name: track.name ?? null,
-            track_artists: Array.isArray(track.artists) ? track.artists.map((artist) => artist?.name).filter(Boolean) : [],
+            track_artists: Array.isArray(track.artists) ? track.artists.map(() => undefined).filter(Boolean) : [],
             duration_ms: track.duration_ms ?? null,
         };
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected { device_id: 'device-1', …(3) } to deeply equal { device_id: 'device-1', …(3) }

[Killed] MethodExpression
kiosk-web/spotify-player.js:31:59
             track_uri: track.uri ?? null,
             track_id: track.id ?? null,
             track_name: track.name ?? null,
-            track_artists: Array.isArray(track.artists) ? track.artists.map((artist) => artist?.name).filter(Boolean) : [],
+            track_artists: Array.isArray(track.artists) ? track.artists.map(artist => artist?.name) : [],
             duration_ms: track.duration_ms ?? null,
         };
killedBy: kiosk spotify helpers filters null artist entries out of track_artists
statusReason: expected [ 'Artist A', undefined, 'Artist B' ] to deeply equal [ 'Artist A', 'Artist B' ]

[Killed] LogicalOperator
kiosk-web/spotify-player.js:32:26
             track_id: track.id ?? null,
             track_name: track.name ?? null,
             track_artists: Array.isArray(track.artists) ? track.artists.map((artist) => artist?.name).filter(Boolean) : [],
-            duration_ms: track.duration_ms ?? null,
+            duration_ms: track.duration_ms && null,
         };
     }
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected { device_id: 'device-1', …(3) } to deeply equal { device_id: 'device-1', …(3) }

[Killed] BlockStatement
kiosk-web/spotify-player.js:36:55
         };
     }
 
-    function didTrackEnd(previousState, currentState) {
-        if (!previousState?.track_uri || !previousState?.duration_ms) {
-            return false;
-        }
-
-        const previousNearEnd = previousState.position_ms >= Math.max(0, previousState.duration_ms - 1500);
-        if (!previousNearEnd) {
-            return false;
-        }
-
-        if (!currentState.track_uri) {
-            return true;
-        }
-
-        return currentState.track_uri === previousState.track_uri
-            && currentState.paused
-            && currentState.position_ms === 0;
-    }
+    function didTrackEnd(previousState, currentState) {}
 
     function mapSpotifyPlayerState(state, previousState = null) {
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected { device_id: 'device-1', …(3) } to deeply equal { device_id: 'device-1', …(3) }

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:37:42
     }
 
     function didTrackEnd(previousState, currentState) {
-        if (!previousState?.track_uri || !previousState?.duration_ms) {
+        if (!previousState?.track_uri || previousState?.duration_ms) {
             return false;
         }
killedBy: kiosk spotify helpers does not mark track end when previous state has duration_ms null even if track_uri exists
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:37:13
     }
 
     function didTrackEnd(previousState, currentState) {
-        if (!previousState?.track_uri || !previousState?.duration_ms) {
+        if (previousState?.track_uri || !previousState?.duration_ms) {
             return false;
         }
killedBy: kiosk spotify helpers marks track end when near end and next state has no current track
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:38:20
 
     function didTrackEnd(previousState, currentState) {
         if (!previousState?.track_uri || !previousState?.duration_ms) {
-            return false;
+            return true;
         }
 
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected { device_id: 'device-1', …(3) } to deeply equal { device_id: 'device-1', …(3) }

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:41:33
             return false;
         }
 
-        const previousNearEnd = previousState.position_ms >= Math.max(0, previousState.duration_ms - 1500);
+        const previousNearEnd = true;
         if (!previousNearEnd) {
             return false;
killedBy: kiosk spotify helpers does not mark track end when previous position was not near the end
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
kiosk-web/spotify-player.js:41:33
             return false;
         }
 
-        const previousNearEnd = previousState.position_ms >= Math.max(0, previousState.duration_ms - 1500);
+        const previousNearEnd = previousState.position_ms < Math.max(0, previousState.duration_ms - 1500);
         if (!previousNearEnd) {
             return false;
killedBy: kiosk playback helpers detects spotify track end from polled player state when the sdk does not push a final event
statusReason: expected "handleSpotifyTrackEnded" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:42:13
         }
 
         const previousNearEnd = previousState.position_ms >= Math.max(0, previousState.duration_ms - 1500);
-        if (!previousNearEnd) {
+        if (false) {
             return false;
         }
killedBy: kiosk spotify helpers does not mark track end when previous position was not near the end
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:42:13
         }
 
         const previousNearEnd = previousState.position_ms >= Math.max(0, previousState.duration_ms - 1500);
-        if (!previousNearEnd) {
+        if (true) {
             return false;
         }
killedBy: kiosk spotify helpers marks track end when near end and next state has no current track
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:43:20
 
         const previousNearEnd = previousState.position_ms >= Math.max(0, previousState.duration_ms - 1500);
         if (!previousNearEnd) {
-            return false;
+            return true;
         }
 
killedBy: kiosk spotify helpers does not mark track end when previous position was not near the end
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:46:13
             return false;
         }
 
-        if (!currentState.track_uri) {
+        if (true) {
             return true;
         }
killedBy: kiosk spotify helpers does not mark track end when same track is near end but not paused at position 0
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:46:13
             return false;
         }
 
-        if (!currentState.track_uri) {
+        if (currentState.track_uri) {
             return true;
         }
killedBy: kiosk playback helpers detects spotify track end from polled player state when the sdk does not push a final event
statusReason: expected "handleSpotifyTrackEnded" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:47:20
         }
 
         if (!currentState.track_uri) {
-            return true;
+            return false;
         }
 
killedBy: kiosk spotify helpers marks track end when near end and next state has no current track
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
kiosk-web/spotify-player.js:50:16
             return true;
         }
 
-        return currentState.track_uri === previousState.track_uri
+        return currentState.track_uri !== previousState.track_uri
             && currentState.paused
             && currentState.position_ms === 0;
killedBy: kiosk spotify helpers marks track end when the same song resets after reaching the end
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:50:16
             return true;
         }
 
-        return currentState.track_uri === previousState.track_uri
-            && currentState.paused
-            && currentState.position_ms === 0;
+        return false;
     }
 
killedBy: kiosk spotify helpers marks track end when the same song resets after reaching the end
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
kiosk-web/spotify-player.js:52:16
 
         return currentState.track_uri === previousState.track_uri
             && currentState.paused
-            && currentState.position_ms === 0;
+            && currentState.position_ms !== 0;
     }
 
killedBy: kiosk spotify helpers marks track end when the same song resets after reaching the end
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
kiosk-web/spotify-player.js:52:16
 
         return currentState.track_uri === previousState.track_uri
             && currentState.paused
-            && currentState.position_ms === 0;
+            && true;
     }
 

[Killed] BlockStatement
kiosk-web/spotify-player.js:55:65
             && currentState.position_ms === 0;
     }
 
-    function mapSpotifyPlayerState(state, previousState = null) {
-        const currentTrack = state?.track_window?.current_track ?? null;
-        const durationMs = currentTrack?.duration_ms ?? null;
-        const positionMs = typeof state?.position === 'number' ? state.position : 0;
-        const mappedState = {
-            paused: Boolean(state?.paused),
-            position_ms: positionMs,
-            duration_ms: durationMs,
-            ...normalizeTrack(currentTrack),
-        };
-
-        return {
-            ...mappedState,
-            track_ended: didTrackEnd(previousState, mappedState),
-        };
-    }
+    function mapSpotifyPlayerState(state, previousState = null) {}
 
     function buildSpotifyRegistrationPayload(params) {
killedBy: kiosk playback helpers polls spotify state so the 80 percent autoplay rule uses fresh playback progress
statusReason: expected [ Array(1) ] to include 'http://127.0.0.1:3000/api/v1/jukebox/…'

[Killed] LogicalOperator
kiosk-web/spotify-player.js:56:30
     }
 
     function mapSpotifyPlayerState(state, previousState = null) {
-        const currentTrack = state?.track_window?.current_track ?? null;
+        const currentTrack = state?.track_window?.current_track && null;
         const durationMs = currentTrack?.duration_ms ?? null;
         const positionMs = typeof state?.position === 'number' ? state.position : 0;
killedBy: kiosk playback helpers polls spotify state so the 80 percent autoplay rule uses fresh playback progress
statusReason: expected [ Array(1) ] to include 'http://127.0.0.1:3000/api/v1/jukebox/…'

[Killed] OptionalChaining
kiosk-web/spotify-player.js:56:30
     }
 
     function mapSpotifyPlayerState(state, previousState = null) {
-        const currentTrack = state?.track_window?.current_track ?? null;
+        const currentTrack = state.track_window?.current_track ?? null;
         const durationMs = currentTrack?.duration_ms ?? null;
         const positionMs = typeof state?.position === 'number' ? state.position : 0;
killedBy: kiosk spotify helpers maps a null state to a fully null track payload
statusReason: Cannot read properties of null (reading 'track_window')

[Killed] OptionalChaining
kiosk-web/spotify-player.js:57:28
 
     function mapSpotifyPlayerState(state, previousState = null) {
         const currentTrack = state?.track_window?.current_track ?? null;
-        const durationMs = currentTrack?.duration_ms ?? null;
+        const durationMs = currentTrack.duration_ms ?? null;
         const positionMs = typeof state?.position === 'number' ? state.position : 0;
         const mappedState = {
killedBy: kiosk playback helpers detects spotify track end from polled player state when the sdk does not push a final event
statusReason: expected "handleSpotifyTrackEnded" to be called 1 times, but got 0 times

[Survived] LogicalOperator
kiosk-web/spotify-player.js:57:28
 
     function mapSpotifyPlayerState(state, previousState = null) {
         const currentTrack = state?.track_window?.current_track ?? null;
-        const durationMs = currentTrack?.duration_ms ?? null;
+        const durationMs = currentTrack?.duration_ms && null;
         const positionMs = typeof state?.position === 'number' ? state.position : 0;
         const mappedState = {

[Killed] OptionalChaining
kiosk-web/spotify-player.js:58:35
     function mapSpotifyPlayerState(state, previousState = null) {
         const currentTrack = state?.track_window?.current_track ?? null;
         const durationMs = currentTrack?.duration_ms ?? null;
-        const positionMs = typeof state?.position === 'number' ? state.position : 0;
+        const positionMs = typeof state.position === 'number' ? state.position : 0;
         const mappedState = {
             paused: Boolean(state?.paused),
killedBy: kiosk spotify helpers maps a null state to a fully null track payload
statusReason: Cannot read properties of null (reading 'position')

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:58:28
     function mapSpotifyPlayerState(state, previousState = null) {
         const currentTrack = state?.track_window?.current_track ?? null;
         const durationMs = currentTrack?.duration_ms ?? null;
-        const positionMs = typeof state?.position === 'number' ? state.position : 0;
+        const positionMs = false ? state.position : 0;
         const mappedState = {
             paused: Boolean(state?.paused),
killedBy: kiosk playback helpers polls spotify state so the 80 percent autoplay rule uses fresh playback progress
statusReason: expected [ Array(1) ] to include 'http://127.0.0.1:3000/api/v1/jukebox/…'

[Killed] ObjectLiteral
kiosk-web/spotify-player.js:59:29
         const currentTrack = state?.track_window?.current_track ?? null;
         const durationMs = currentTrack?.duration_ms ?? null;
         const positionMs = typeof state?.position === 'number' ? state.position : 0;
-        const mappedState = {
-            paused: Boolean(state?.paused),
-            position_ms: positionMs,
-            duration_ms: durationMs,
-            ...normalizeTrack(currentTrack),
-        };
+        const mappedState = {};
 
         return {
killedBy: kiosk playback helpers polls spotify state so the 80 percent autoplay rule uses fresh playback progress
statusReason: expected [ Array(1) ] to include 'http://127.0.0.1:3000/api/v1/jukebox/…'

[Killed] OptionalChaining
kiosk-web/spotify-player.js:60:29
         const durationMs = currentTrack?.duration_ms ?? null;
         const positionMs = typeof state?.position === 'number' ? state.position : 0;
         const mappedState = {
-            paused: Boolean(state?.paused),
+            paused: Boolean(state.paused),
             position_ms: positionMs,
             duration_ms: durationMs,
killedBy: kiosk playback helpers detects spotify track end from polled player state when the sdk does not push a final event
statusReason: expected "handleSpotifyTrackEnded" to be called 1 times, but got 0 times

[Killed] BlockStatement
kiosk-web/spotify-player.js:72:54
         };
     }
 
-    function buildSpotifyRegistrationPayload(params) {
-        return {
-            device_id: params.deviceId,
-            spotify_device_id: params.spotifyDeviceId,
-            player_name: params.playerName ? String(params.playerName).trim() : null,
-            player_state: params.state ? mapSpotifyPlayerState(params.state) : null,
-        };
-    }
+    function buildSpotifyRegistrationPayload(params) {}
 
     function loadSpotifySdk(options = {}) {
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected undefined to deeply equal { device_id: 'device-1', …(3) }

[Killed] ObjectLiteral
kiosk-web/spotify-player.js:73:16
     }
 
     function buildSpotifyRegistrationPayload(params) {
-        return {
-            device_id: params.deviceId,
-            spotify_device_id: params.spotifyDeviceId,
-            player_name: params.playerName ? String(params.playerName).trim() : null,
-            player_state: params.state ? mapSpotifyPlayerState(params.state) : null,
-        };
+        return {};
     }
 
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected {} to deeply equal { device_id: 'device-1', …(3) }

[Killed] MethodExpression
kiosk-web/spotify-player.js:76:46
         return {
             device_id: params.deviceId,
             spotify_device_id: params.spotifyDeviceId,
-            player_name: params.playerName ? String(params.playerName).trim() : null,
+            player_name: params.playerName ? String(params.playerName) : null,
             player_state: params.state ? mapSpotifyPlayerState(params.state) : null,
         };
killedBy: kiosk spotify helpers builds a normalized spotify registration payload
statusReason: expected { device_id: 'device-1', …(3) } to deeply equal { device_id: 'device-1', …(3) }

[Killed] LogicalOperator
kiosk-web/spotify-player.js:82:27
     }
 
     function loadSpotifySdk(options = {}) {
-        const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
+        const rootScope = options.root && (typeof globalThis !== 'undefined' ? globalThis : this);
 
         if (rootScope.Spotify?.Player) {
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: Cannot read properties of undefined (reading 'src')

[NoCoverage] EqualityOperator
kiosk-web/spotify-player.js:82:44
     }
 
     function loadSpotifySdk(options = {}) {
-        const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
+        const rootScope = options.root ?? (typeof globalThis === 'undefined' ? globalThis : this);
 
         if (rootScope.Spotify?.Player) {

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:84:13
     function loadSpotifySdk(options = {}) {
         const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
 
-        if (rootScope.Spotify?.Player) {
+        if (false) {
             return Promise.resolve(rootScope.Spotify);
         }
killedBy: kiosk spotify helpers resolves immediately when the spotify sdk is already loaded
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:84:13
     function loadSpotifySdk(options = {}) {
         const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
 
-        if (rootScope.Spotify?.Player) {
+        if (true) {
             return Promise.resolve(rootScope.Spotify);
         }
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: Cannot read properties of undefined (reading 'src')

[Killed] BlockStatement
kiosk-web/spotify-player.js:88:29
             return Promise.resolve(rootScope.Spotify);
         }
 
-        if (sdkLoadPromise) {
-            return sdkLoadPromise;
-        }
+        if (sdkLoadPromise) {}
 
         const documentScope = rootScope.document;
killedBy: kiosk spotify helpers loads the Spotify SDK only once and resolves when the ready callback fires
statusReason: expected Promise{…} to be Promise{…} // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Promise{…}
Received: serializes to the same string

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:88:13
             return Promise.resolve(rootScope.Spotify);
         }
 
-        if (sdkLoadPromise) {
+        if (false) {
             return sdkLoadPromise;
         }
killedBy: kiosk spotify helpers loads the Spotify SDK only once and resolves when the ready callback fires
statusReason: expected Promise{…} to be Promise{…} // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Promise{…}
Received: serializes to the same string

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:93:13
         }
 
         const documentScope = rootScope.document;
-        if (!documentScope) {
+        if (true) {
             return Promise.reject(new Error('Spotify SDK requires a document'));
         }
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: Cannot read properties of undefined (reading 'src')

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:93:13
         }
 
         const documentScope = rootScope.document;
-        if (!documentScope) {
+        if (documentScope) {
             return Promise.reject(new Error('Spotify SDK requires a document'));
         }
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: Cannot read properties of undefined (reading 'src')

[NoCoverage] StringLiteral
kiosk-web/spotify-player.js:94:45
 
         const documentScope = rootScope.document;
         if (!documentScope) {
-            return Promise.reject(new Error('Spotify SDK requires a document'));
+            return Promise.reject(new Error(""));
         }
 

[Killed] BlockStatement
kiosk-web/spotify-player.js:97:59
             return Promise.reject(new Error('Spotify SDK requires a document'));
         }
 
-        sdkLoadPromise = new Promise((resolve, reject) => {
-            const script = documentScope.createElement('script');
-            script.src = options.scriptUrl || SDK_URL;
-            script.async = true;
-            script.defer = true;
-            script.dataset.spotifyWebPlaybackSdk = 'true';
-            script.onerror = () => {
-                sdkLoadPromise = null;
-                reject(new Error('Failed to load Spotify Web Playback SDK'));
-            };
-
-            const previousReady = rootScope.onSpotifyWebPlaybackSDKReady;
-            rootScope.onSpotifyWebPlaybackSDKReady = () => {
-                if (typeof previousReady === 'function') {
-                    previousReady();
-                }
-                resolve(rootScope.Spotify);
-            };
-
-            const target = documentScope.head || documentScope.body || documentScope.documentElement;
-            target.appendChild(script);
-        });
+        sdkLoadPromise = new Promise((resolve, reject) => {});
 
         return sdkLoadPromise;
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: Cannot read properties of undefined (reading 'src')

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:99:26
 
         sdkLoadPromise = new Promise((resolve, reject) => {
             const script = documentScope.createElement('script');
-            script.src = options.scriptUrl || SDK_URL;
+            script.src = true;
             script.async = true;
             script.defer = true;
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: expected true to be 'https://sdk.scdn.co/spotify-player.js' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:99:26
 
         sdkLoadPromise = new Promise((resolve, reject) => {
             const script = documentScope.createElement('script');
-            script.src = options.scriptUrl || SDK_URL;
+            script.src = false;
             script.async = true;
             script.defer = true;
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: expected false to be 'https://sdk.scdn.co/spotify-player.js' // Object.is equality

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:100:28
         sdkLoadPromise = new Promise((resolve, reject) => {
             const script = documentScope.createElement('script');
             script.src = options.scriptUrl || SDK_URL;
-            script.async = true;
+            script.async = false;
             script.defer = true;
             script.dataset.spotifyWebPlaybackSdk = 'true';
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:101:28
             const script = documentScope.createElement('script');
             script.src = options.scriptUrl || SDK_URL;
             script.async = true;
-            script.defer = true;
+            script.defer = false;
             script.dataset.spotifyWebPlaybackSdk = 'true';
             script.onerror = () => {
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: expected false to be true // Object.is equality
