[Killed] StringLiteral
kiosk-web/spotify-player.js:102:52
             script.src = options.scriptUrl || SDK_URL;
             script.async = true;
             script.defer = true;
-            script.dataset.spotifyWebPlaybackSdk = 'true';
+            script.dataset.spotifyWebPlaybackSdk = "";
             script.onerror = () => {
                 sdkLoadPromise = null;
killedBy: kiosk spotify helpers verifies script element properties when loading the sdk
statusReason: expected '' to be 'true' // Object.is equality

[Killed] BlockStatement
kiosk-web/spotify-player.js:103:36
             script.async = true;
             script.defer = true;
             script.dataset.spotifyWebPlaybackSdk = 'true';
-            script.onerror = () => {
-                sdkLoadPromise = null;
-                reject(new Error('Failed to load Spotify Web Playback SDK'));
-            };
+            script.onerror = () => {};
 
             const previousReady = rootScope.onSpotifyWebPlaybackSDKReady;
killedBy: kiosk spotify helpers calls an existing onSpotifyWebPlaybackSDKReady when the sdk loads
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
kiosk-web/spotify-player.js:105:34
             script.dataset.spotifyWebPlaybackSdk = 'true';
             script.onerror = () => {
                 sdkLoadPromise = null;
-                reject(new Error('Failed to load Spotify Web Playback SDK'));
+                reject(new Error(""));
             };
 
killedBy: kiosk spotify helpers rejects and resets the load promise when the sdk script fails to load
statusReason: expected [Function] to throw error including 'Failed to load Spotify Web Playback S…' but got ''

[Killed] BlockStatement
kiosk-web/spotify-player.js:109:60
             };
 
             const previousReady = rootScope.onSpotifyWebPlaybackSDKReady;
-            rootScope.onSpotifyWebPlaybackSDKReady = () => {
-                if (typeof previousReady === 'function') {
-                    previousReady();
-                }
-                resolve(rootScope.Spotify);
-            };
+            rootScope.onSpotifyWebPlaybackSDKReady = () => {};
 
             const target = documentScope.head || documentScope.body || documentScope.documentElement;
killedBy: kiosk spotify helpers calls an existing onSpotifyWebPlaybackSDKReady when the sdk loads
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
kiosk-web/spotify-player.js:110:58
 
             const previousReady = rootScope.onSpotifyWebPlaybackSDKReady;
             rootScope.onSpotifyWebPlaybackSDKReady = () => {
-                if (typeof previousReady === 'function') {
-                    previousReady();
-                }
+                if (typeof previousReady === 'function') {}
                 resolve(rootScope.Spotify);
             };
killedBy: kiosk spotify helpers calls an existing onSpotifyWebPlaybackSDKReady when the sdk loads
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:110:21
 
             const previousReady = rootScope.onSpotifyWebPlaybackSDKReady;
             rootScope.onSpotifyWebPlaybackSDKReady = () => {
-                if (typeof previousReady === 'function') {
+                if (true) {
                     previousReady();
                 }
killedBy: kiosk spotify helpers loads the Spotify SDK only once and resolves when the ready callback fires
statusReason: previousReady is not a function

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:116:28
                 resolve(rootScope.Spotify);
             };
 
-            const target = documentScope.head || documentScope.body || documentScope.documentElement;
+            const target = false;
             target.appendChild(script);
         });
killedBy: kiosk spotify helpers calls an existing onSpotifyWebPlaybackSDKReady when the sdk loads
statusReason: target.appendChild is not a function

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:116:28
                 resolve(rootScope.Spotify);
             };
 
-            const target = documentScope.head || documentScope.body || documentScope.documentElement;
+            const target = false || documentScope.documentElement;
             target.appendChild(script);
         });
killedBy: kiosk spotify helpers loads the Spotify SDK only once and resolves when the ready callback fires
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
kiosk-web/spotify-player.js:124:27
     }
 
     function createSpotifyPlayer(options = {}) {
-        const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
+        const rootScope = options.root && (typeof globalThis !== 'undefined' ? globalThis : this);
         const SpotifyPlayer = rootScope.Spotify?.Player;
 
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: Spotify SDK has not been loaded

[NoCoverage] EqualityOperator
kiosk-web/spotify-player.js:124:44
     }
 
     function createSpotifyPlayer(options = {}) {
-        const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
+        const rootScope = options.root ?? (typeof globalThis === 'undefined' ? globalThis : this);
         const SpotifyPlayer = rootScope.Spotify?.Player;
 

[Survived] OptionalChaining
kiosk-web/spotify-player.js:125:31
 
     function createSpotifyPlayer(options = {}) {
         const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
-        const SpotifyPlayer = rootScope.Spotify?.Player;
+        const SpotifyPlayer = rootScope.Spotify.Player;
 
         if (!SpotifyPlayer) {

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:127:13
         const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
         const SpotifyPlayer = rootScope.Spotify?.Player;
 
-        if (!SpotifyPlayer) {
+        if (true) {
             throw new Error('Spotify SDK has not been loaded');
         }
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: Spotify SDK has not been loaded

[Killed] BooleanLiteral
kiosk-web/spotify-player.js:127:13
         const rootScope = options.root ?? (typeof globalThis !== 'undefined' ? globalThis : this);
         const SpotifyPlayer = rootScope.Spotify?.Player;
 
-        if (!SpotifyPlayer) {
+        if (SpotifyPlayer) {
             throw new Error('Spotify SDK has not been loaded');
         }
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: Spotify SDK has not been loaded

[NoCoverage] StringLiteral
kiosk-web/spotify-player.js:128:29
         const SpotifyPlayer = rootScope.Spotify?.Player;
 
         if (!SpotifyPlayer) {
-            throw new Error('Spotify SDK has not been loaded');
+            throw new Error("");
         }
 

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:135:19
         let lastMappedState = null;
 
         const player = new SpotifyPlayer({
-            name: options.playerName || 'RadioTEDU Kiosk',
+            name: true,
             getOAuthToken: async (callback) => {
                 const token = await options.getOAuthToken();
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected true to be 'Kiosk Browser' // Object.is equality

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:135:19
         let lastMappedState = null;
 
         const player = new SpotifyPlayer({
-            name: options.playerName || 'RadioTEDU Kiosk',
+            name: false,
             getOAuthToken: async (callback) => {
                 const token = await options.getOAuthToken();
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected false to be 'Kiosk Browser' // Object.is equality

[Killed] BlockStatement
kiosk-web/spotify-player.js:136:48
 
         const player = new SpotifyPlayer({
             name: options.playerName || 'RadioTEDU Kiosk',
-            getOAuthToken: async (callback) => {
-                const token = await options.getOAuthToken();
-                callback(token);
-            },
+            getOAuthToken: async (callback) => {},
             volume: typeof options.volume === 'number' ? options.volume : 1,
         });
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ 'token-1' ]

Number of calls: 0

[Killed] EqualityOperator
kiosk-web/spotify-player.js:140:21
                 const token = await options.getOAuthToken();
                 callback(token);
             },
-            volume: typeof options.volume === 'number' ? options.volume : 1,
+            volume: typeof options.volume !== 'number' ? options.volume : 1,
         });
 
killedBy: kiosk spotify helpers passes the volume option to the sdk player config
statusReason: expected 1 to be 0.5 // Object.is equality

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:140:21
                 const token = await options.getOAuthToken();
                 callback(token);
             },
-            volume: typeof options.volume === 'number' ? options.volume : 1,
+            volume: false ? options.volume : 1,
         });
 
killedBy: kiosk spotify helpers passes the volume option to the sdk player config
statusReason: expected 1 to be 0.5 // Object.is equality

[Killed] BlockStatement
kiosk-web/spotify-player.js:143:50
             volume: typeof options.volume === 'number' ? options.volume : 1,
         });
 
-        player.addListener('ready', (payload) => {
-            lastDeviceId = payload?.device_id ?? null;
-            options.onReady?.(
-                buildSpotifyRegistrationPayload({
-                    deviceId: options.deviceId || payload?.device_id || '',
-                    spotifyDeviceId: payload?.device_id || '',
-                    playerName: options.playerName || null,
-                    state: null,
-                })
-            );
-        });
+        player.addListener('ready', (payload) => {});
 
         player.addListener('not_ready', (payload) => {
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Number of calls: 0

[Killed] StringLiteral
kiosk-web/spotify-player.js:143:28
             volume: typeof options.volume === 'number' ? options.volume : 1,
         });
 
-        player.addListener('ready', (payload) => {
+        player.addListener("", (payload) => {
             lastDeviceId = payload?.device_id ?? null;
             options.onReady?.(
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Number of calls: 0

[Killed] LogicalOperator
kiosk-web/spotify-player.js:144:28
         });
 
         player.addListener('ready', (payload) => {
-            lastDeviceId = payload?.device_id ?? null;
+            lastDeviceId = payload?.device_id && null;
             options.onReady?.(
                 buildSpotifyRegistrationPayload({
killedBy: kiosk spotify helpers tracks last device id from the ready event via getLastDeviceId
statusReason: expected null to be 'device-abc' // Object.is equality

[Survived] OptionalChaining
kiosk-web/spotify-player.js:144:28
         });
 
         player.addListener('ready', (payload) => {
-            lastDeviceId = payload?.device_id ?? null;
+            lastDeviceId = payload.device_id ?? null;
             options.onReady?.(
                 buildSpotifyRegistrationPayload({

[Survived] OptionalChaining
kiosk-web/spotify-player.js:145:13
 
         player.addListener('ready', (payload) => {
             lastDeviceId = payload?.device_id ?? null;
-            options.onReady?.(
-                buildSpotifyRegistrationPayload({
-                    deviceId: options.deviceId || payload?.device_id || '',
-                    spotifyDeviceId: payload?.device_id || '',
-                    playerName: options.playerName || null,
-                    state: null,
-                })
-            );
+            options.onReady(buildSpotifyRegistrationPayload({
+  deviceId: options.deviceId || payload?.device_id || '',
+  spotifyDeviceId: payload?.device_id || '',
+  playerName: options.playerName || null,
+  state: null
+}));
         });
 

[Killed] ObjectLiteral
kiosk-web/spotify-player.js:146:49
         player.addListener('ready', (payload) => {
             lastDeviceId = payload?.device_id ?? null;
             options.onReady?.(
-                buildSpotifyRegistrationPayload({
-                    deviceId: options.deviceId || payload?.device_id || '',
-                    spotifyDeviceId: payload?.device_id || '',
-                    playerName: options.playerName || null,
-                    state: null,
-                })
+                buildSpotifyRegistrationPayload({})
             );
         });
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
kiosk-web/spotify-player.js:147:31
             lastDeviceId = payload?.device_id ?? null;
             options.onReady?.(
                 buildSpotifyRegistrationPayload({
-                    deviceId: options.deviceId || payload?.device_id || '',
+                    deviceId: (options.deviceId || payload?.device_id) && '',
                     spotifyDeviceId: payload?.device_id || '',
                     playerName: options.playerName || null,
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
kiosk-web/spotify-player.js:147:31
             lastDeviceId = payload?.device_id ?? null;
             options.onReady?.(
                 buildSpotifyRegistrationPayload({
-                    deviceId: options.deviceId || payload?.device_id || '',
+                    deviceId: options.deviceId && payload?.device_id || '',
                     spotifyDeviceId: payload?.device_id || '',
                     playerName: options.playerName || null,
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
kiosk-web/spotify-player.js:148:38
             options.onReady?.(
                 buildSpotifyRegistrationPayload({
                     deviceId: options.deviceId || payload?.device_id || '',
-                    spotifyDeviceId: payload?.device_id || '',
+                    spotifyDeviceId: payload?.device_id && '',
                     playerName: options.playerName || null,
                     state: null,
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:148:38
             options.onReady?.(
                 buildSpotifyRegistrationPayload({
                     deviceId: options.deviceId || payload?.device_id || '',
-                    spotifyDeviceId: payload?.device_id || '',
+                    spotifyDeviceId: true,
                     playerName: options.playerName || null,
                     state: null,
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:149:33
                 buildSpotifyRegistrationPayload({
                     deviceId: options.deviceId || payload?.device_id || '',
                     spotifyDeviceId: payload?.device_id || '',
-                    playerName: options.playerName || null,
+                    playerName: false,
                     state: null,
                 })
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
kiosk-web/spotify-player.js:149:33
                 buildSpotifyRegistrationPayload({
                     deviceId: options.deviceId || payload?.device_id || '',
                     spotifyDeviceId: payload?.device_id || '',
-                    playerName: options.playerName || null,
+                    playerName: true,
                     state: null,
                 })
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
kiosk-web/spotify-player.js:155:54
             );
         });
 
-        player.addListener('not_ready', (payload) => {
-            options.onNotReady?.({
-                device_id: payload?.device_id ?? null,
-                spotify_device_id: payload?.device_id ?? null,
-            });
-        });
+        player.addListener('not_ready', (payload) => {});
 
         player.addListener('player_state_changed', (state) => {
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Killed] StringLiteral
kiosk-web/spotify-player.js:155:28
             );
         });
 
-        player.addListener('not_ready', (payload) => {
+        player.addListener("", (payload) => {
             options.onNotReady?.({
                 device_id: payload?.device_id ?? null,
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Survived] OptionalChaining
kiosk-web/spotify-player.js:156:13
         });
 
         player.addListener('not_ready', (payload) => {
-            options.onNotReady?.({
-                device_id: payload?.device_id ?? null,
-                spotify_device_id: payload?.device_id ?? null,
-            });
+            options.onNotReady({
+  device_id: payload?.device_id ?? null,
+  spotify_device_id: payload?.device_id ?? null
+});
         });
 

[Killed] LogicalOperator
kiosk-web/spotify-player.js:157:28
 
         player.addListener('not_ready', (payload) => {
             options.onNotReady?.({
-                device_id: payload?.device_id ?? null,
+                device_id: payload?.device_id && null,
                 spotify_device_id: payload?.device_id ?? null,
             });
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Survived] OptionalChaining
kiosk-web/spotify-player.js:157:28
 
         player.addListener('not_ready', (payload) => {
             options.onNotReady?.({
-                device_id: payload?.device_id ?? null,
+                device_id: payload.device_id ?? null,
                 spotify_device_id: payload?.device_id ?? null,
             });

[Killed] LogicalOperator
kiosk-web/spotify-player.js:158:36
         player.addListener('not_ready', (payload) => {
             options.onNotReady?.({
                 device_id: payload?.device_id ?? null,
-                spotify_device_id: payload?.device_id ?? null,
+                spotify_device_id: payload?.device_id && null,
             });
         });
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Survived] OptionalChaining
kiosk-web/spotify-player.js:158:36
         player.addListener('not_ready', (payload) => {
             options.onNotReady?.({
                 device_id: payload?.device_id ?? null,
-                spotify_device_id: payload?.device_id ?? null,
+                spotify_device_id: payload.device_id ?? null,
             });
         });

[Killed] BlockStatement
kiosk-web/spotify-player.js:162:63
             });
         });
 
-        player.addListener('player_state_changed', (state) => {
-            const mappedState = mapSpotifyPlayerState(state, lastMappedState);
-            lastMappedState = mappedState;
-            options.onStateChange?.(mappedState);
-        });
+        player.addListener('player_state_changed', (state) => {});
 
         player.addListener('autoplay_failed', (payload) => {
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ { paused: false, …(7) } ]

Number of calls: 0

[Survived] OptionalChaining
kiosk-web/spotify-player.js:165:13
         player.addListener('player_state_changed', (state) => {
             const mappedState = mapSpotifyPlayerState(state, lastMappedState);
             lastMappedState = mappedState;
-            options.onStateChange?.(mappedState);
+            options.onStateChange(mappedState);
         });
 

[Killed] BlockStatement
kiosk-web/spotify-player.js:168:60
             options.onStateChange?.(mappedState);
         });
 
-        player.addListener('autoplay_failed', (payload) => {
-            options.onAutoplayFailed?.(payload);
-        });
+        player.addListener('autoplay_failed', (payload) => {});
 
         player.addListener('initialization_error', (error) => {
killedBy: kiosk spotify helpers fires error callbacks for sdk error events
statusReason: expected "vi.fn()" to be called with arguments: [ { reason: 'blocked' } ]

Number of calls: 0

[Survived] OptionalChaining
kiosk-web/spotify-player.js:169:13
         });
 
         player.addListener('autoplay_failed', (payload) => {
-            options.onAutoplayFailed?.(payload);
+            options.onAutoplayFailed(payload);
         });
 

[Killed] BlockStatement
kiosk-web/spotify-player.js:172:63
             options.onAutoplayFailed?.(payload);
         });
 
-        player.addListener('initialization_error', (error) => {
-            options.onError?.(error);
-        });
+        player.addListener('initialization_error', (error) => {});
 
         player.addListener('authentication_error', (error) => {
killedBy: kiosk spotify helpers fires error callbacks for sdk error events
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Survived] OptionalChaining
kiosk-web/spotify-player.js:173:13
         });
 
         player.addListener('initialization_error', (error) => {
-            options.onError?.(error);
+            options.onError(error);
         });
 

[Killed] BlockStatement
kiosk-web/spotify-player.js:176:63
             options.onError?.(error);
         });
 
-        player.addListener('authentication_error', (error) => {
-            options.onError?.(error);
-        });
+        player.addListener('authentication_error', (error) => {});
 
         player.addListener('account_error', (error) => {
killedBy: kiosk spotify helpers fires error callbacks for sdk error events
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Survived] OptionalChaining
kiosk-web/spotify-player.js:177:13
         });
 
         player.addListener('authentication_error', (error) => {
-            options.onError?.(error);
+            options.onError(error);
         });
 

[Killed] BlockStatement
kiosk-web/spotify-player.js:180:56
             options.onError?.(error);
         });
 
-        player.addListener('account_error', (error) => {
-            options.onError?.(error);
-        });
+        player.addListener('account_error', (error) => {});
 
         return {
killedBy: kiosk spotify helpers fires error callbacks for sdk error events
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Survived] OptionalChaining
kiosk-web/spotify-player.js:181:13
         });
 
         player.addListener('account_error', (error) => {
-            options.onError?.(error);
+            options.onError(error);
         });
 

[Killed] ObjectLiteral
kiosk-web/spotify-player.js:184:16
             options.onError?.(error);
         });
 
-        return {
-            player,
-            connect: () => player.connect(),
-            activateElement: () => player.activateElement(),
-            disconnect: () => player.disconnect(),
-            getLastDeviceId: () => lastDeviceId,
-        };
+        return {};
     }
 
killedBy: kiosk spotify helpers creates a spotify player wrapper that wires sdk callbacks
statusReason: expected undefined to be type of 'function'

[Killed] ArrowFunction
kiosk-web/spotify-player.js:186:22
 
         return {
             player,
-            connect: () => player.connect(),
+            connect: () => undefined,
             activateElement: () => player.activateElement(),
             disconnect: () => player.disconnect(),
killedBy: kiosk spotify helpers wrapper methods delegate to the underlying sdk player
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
kiosk-web/spotify-player.js:187:30
         return {
             player,
             connect: () => player.connect(),
-            activateElement: () => player.activateElement(),
+            activateElement: () => undefined,
             disconnect: () => player.disconnect(),
             getLastDeviceId: () => lastDeviceId,
killedBy: kiosk spotify helpers wrapper methods delegate to the underlying sdk player
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
kiosk-web/spotify-player.js:188:25
             player,
             connect: () => player.connect(),
             activateElement: () => player.activateElement(),
-            disconnect: () => player.disconnect(),
+            disconnect: () => undefined,
             getLastDeviceId: () => lastDeviceId,
         };
killedBy: kiosk spotify helpers wrapper methods delegate to the underlying sdk player
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
kiosk-web/spotify-player.js:189:30
             connect: () => player.connect(),
             activateElement: () => player.activateElement(),
             disconnect: () => player.disconnect(),
-            getLastDeviceId: () => lastDeviceId,
+            getLastDeviceId: () => undefined,
         };
     }
killedBy: kiosk spotify helpers tracks last device id from the ready event via getLastDeviceId
statusReason: expected undefined to be null // Object.is equality
